{
  "paragraphs": [
    {
      "text": "%md\n#¿Qué es big data?\n\nA lo largo de los ultimos años se han creado diferentes definiciones de big data, una de las más aceptadas es la de [Gartner(2001)](https://www.gartner.com/it-glossary/big-data):\n\n*\"Big Data son activos de información de gran volumen, alta velocidad y gran variedad, que demandan formas rentables e innovadoras de procesamiento, lo que permiten un mejor conocimiento, toma de decisiones y automatización de procesos\"*.\n\nDicho de otro modo, big data está formado por conjuntos de datos de mayor tamaño y más complejos que los tradicionales, especialmente procedentes de nuevas fuentes de datos. Estos conjuntos de datos son tan voluminosos que el software de procesamiento de datos convencional sencillamente no puede gestionarlos. Sin embargo, estos volúmenes masivos de datos pueden utilizarse para abordar problemas que antes no hubiera sido posible solucionar.\n\n###Las tres V\u0027s de big data\n\n\n\u003cp align\u003d\"center\"\u003e\n  \u003cimg width\u003d\"460\" height\u003d\"300\" src\u003d\"https://www.whishworks.com/hs-fs/hubfs/Blog/The-3Vs-of-big-data.png?t\u003d1530105246202\u0026width\u003d618\u0026name\u003dThe-3Vs-of-big-data.png\"\u003e\n\u003c/p\u003e\n\n* **Volumen**: Con big data se procesan grandes volúmenes de datos no estructurados de baja densidad, puede tratarse de datos de valor desconocido, como publicaciones de usuarios en una red social, registros de clics en una página web o aplicación para móviles o dispositivos con diferentes sensores. Para algunas organizaciones, esto puede suponer decenas de terabytes de datos. Para otras, incluso cientos de petabytes.\n\n* **Velocidad**: La velocidad es el ritmo al que se reciben los datos y posiblemente al que se aplica alguna acción. Los datos con mayor velocidad normalmente se transmiten directamente a la memoria, en vez de escribirse en un disco. Algunos productos con conexión a internet reciben información constantemente y requieren una evaluación y procesamiento en tiempo real. \n\n* **Variedad**: La variedad hace referencia a los diversos tipos de datos disponibles. Los tipos de datos convencionales eran estructurados y podían organizarse facilmente en una base de datos relacional. Con el auge del big data, los datos se presentan en nuevos tipos de datos no estructurados. Los tipos de datos no estructurados y semiestructurados, como el texto, audio o vídeo, requieren de un preprocesamiento adicional para poder obtener significado.\n\n###Otras caracteristicas\n\nPara muchos, los anteriores 3 aspectos no son suficientes para describir Big Data, es por esto que en los últimos años se han identificado otras caracteristicas de big data (que también comienzan con la letra V), desde las originales [3 V\u0027s](https://blogs.gartner.com/doug-laney/files/2012/01/ad949-3D-Data-Management-Controlling-Data-Volume-Velocity-and-Variety.pdf) se ha llegado a hablar de [4 V\u0027s](http://www.ibmbigdatahub.com/infographic/four-vs-big-data), [5 V\u0027s](https://www.wired.com/insights/2013/05/the-missing-vs-in-big-data-viability-and-value/), [6 V\u0027s](https://insidebigdata.com/2013/09/12/beyond-volume-variety-velocity-issue-big-data-veracity/), [7 V\u0027s](https://datafloq.com/read/3vs-sufficient-describe-big-data/166), [10 V\u0027s](https://mapr.com/blog/top-10-big-data-challenges-serious-look-10-big-data-vs/) e incluso se han llegado a describir [42 V\u0027s](https://www.elderresearch.com/blog/42-v-of-big-data), a continuación se describen algunas de las V\u0027s adicionales:\n\n* **Veracidad**: Tener una gran cantidad de datos de gran volumen entrando a alta velocidad no tiene valor si esos datos son incorrectos. Los datos incorrectos pueden causar muchos problemas tanto para las organizaciones como para los consumidores. Por lo tanto, las organizaciones deben garantizar que los datos sean correctos y que los análisis realizados sobre los datos sean correctos. Especialmente en la toma de decisiones automatizada, donde ya no interviene ningún ser humano, debe asegurarse de que tanto los datos como los análisis sean correctos.\n\n* **Variabilidad**: Big data es extremadamente variable. Brian Hopkins, un analista principal de Forrester, define la variabilidad como la \"varianza en el significado, en el léxico\". Se refiere a la supercomputadora Watson que ganó Jeopardy. La supercomputadora tuvo que \"diseccionar una respuesta en su significado y [...] averiguar cuál era la pregunta correcta\". Eso es extremadamente difícil porque las palabras tienen diferentes significados y todo depende del contexto. Para la respuesta correcta, Watson tuvo que entender el contexto.\n\n* **Visualización**: Hacer que toda esa gran cantidad de datos comprensibles de una manera que sea fácil de entender y leer. Con los análisis y visualizaciones correctos, los datos brutos pueden utilizarse, de lo contrario, los datos en bruto permanecen esencialmente inútiles. Las visualizaciones, por supuesto, no significan gráficos ordinarios o gráficos circulares. Significan gráficos complejos que pueden incluir muchas variables de datos mientras siguen siendo comprensibles y legibles.\n\n* **Valor**: Los datos poseen un valor intrínseco. Sin embargo, no tienen ninguna utilidad hasta que dicho valor se descubre. Hoy en día, el big data se ha convertido en un activo crucial. Piense en algunas de las mayores empresas tecnológicas del mundo. Gran parte del valor que ofrecen procede de sus datos, que analizan constantemente para generar una mayor eficiencia y desarrollar nuevos productos. Avances tecnológicos recientes han reducido exponencialmente el coste del almacenamiento y la computación de datos, haciendo que almacenar datos resulte más fácil y barato que nunca. Identificar el valor del big data no pasa solo por analizarlo (que es ya una ventaja en sí misma). Se trata de todo un proceso de descubrimiento que requiere que los analistas, usuarios empresariales y ejecutivos se planteen las preguntas correctas, identifiquen patrones, tomen decisiones informadas y predigan comportamientos.\n\n\n###La historia de big data\n\nSi bien el concepto \"big data\" en sí mismo es relativamente nuevo, los orígenes de los grandes conjuntos de datos se remontan a las décadas de 1960 y 1970, donde se sitúan los origines de este universo con los primeros centros de datos y el desarrollo de las bases de datos relacionales.\n\nAlrededor de 2005, la gente empezó a darse cuenta de la cantidad de datos que generaban los usuarios a través de Facebook, YouTube y otros servicios online. Ese mismo año, se desarrollaría Hadoop, un marco de código abierto creado específicamente para almacenar y analizar grandes conjuntos de datos. En esta época, también empezaría a adquirir popularidad NoSQL.\n\nEl desarrollo de Framewoks de código abierto tales como Hadoop (y, más recientemente, Spark) sería esencial para el crecimiento del big data, pues estos hacían que el big data resultase más fácil de usar y más barato de almacenar. En los años siguientes, el volumen de big data se ha disparado. Los usuarios continúan generando enormes cantidades de datos, pero ahora los humanos no son los únicos que lo hacen.\n\nCon la llegada del Internet de las cosas (IoT), hay un mayor número de objetos y dispositivos conectados a Internet que generan datos sobre patrones de uso de los clientes y rendimiento de los productos. El surgimiento del aprendizaje automático ha producido aún más datos.\n\nAunque el big data ha llegado lejos, su utilidad no ha hecho más que empezar. El Cloud Computing ha ampliado aún más las posibilidades del big data. La nube ofrece una escalabilidad realmente elástica, donde los desarrolladores pueden simplemente agilizar clústeres ad hoc para probar un subconjunto de datos.\n\n###Ventajas de big data y de la analítica de datos\n\n\n* Mejora de la toma de decisiones: Con el Big Data se pueden analizar datos pasados para hacer predicciones sobre el futuro. Por lo tanto, las empresas no solo pueden tomar mejores decisiones para su día a día, sino también prepararse para el futuro. Esto les da una ventaja competitiva y proporciona un marco más ágil para la toma de decisiones y el manejo de riesgos.\n\n* Reducción de costes: Big Data proporciona la inteligencia empresarial necesaria para reducir costes y mejorar la eficiencia de las operaciones. El análisis de Big Data puede proporcionar información sobre el impacto de diferentes variables en el proceso de producción, ayudando así a las industrias a tomar mejores decisiones.\n\n* Nuevos productos y servicios: Analizando los datos pasados sobre lanzamientos de productos y cruzando esos datos con datos de opiniones de clientes es posible mejorar los nuevos productos que pretendemos lanzar en el futuro. Además de esto, el análisis de mercado en tiempo real permite a las empresas comprender los cambios en la demanda y en el comportamiento de los consumidores lo que ayuda a una comercialización orientada al cliente. Una mayor demanda de servicios personalizados también puede potenciarse mediante el análisis de las necesidades del consumidor, las preferencias y los comportamientos de compra.\n\n* Feedback a tiempo real: Incluso en los momentos en los que es necesario tomar una decisión inmediata, el Big Data es un arma muy poderosa puesto que permite recibir y procesar los datos a tiempo real y contar con la información necesaria rápidamente. El Big Data es por encima de todo una tecnología ágil y veloz que permite permite por ejemplo obtener información a tiempo real del lanzamiento de un producto o el resultado de una estrategia.\n\n* Conocimiento del mercado: El conocimiento del mercado en el que se opera puede ayudar no solo a la toma de decisiones, sino también a la localización de posibles oportunidades mediante el tratamiento de estos datos estructurados y comparables. También puede ayudar a predecir posibles escenarios e incluso a conocer mejor a a los consumidores, mediante un análisis segmentado.\n\n\n###Casos de uso de big data\n\nEl big data puede ayudarle a abordar una serie de actividades empresariales, desde la experiencia de cliente hasta la analítica. A continuación, recopilamos algunas de ellas\n\n####Desarrollo de productos\nEmpresas como Netflix y Procter \u0026 Gamble usan big data para prever la demanda de los clientes. Construyen modelos predictivos para nuevos productos y servicios clasificando atributos clave de productos anteriores y actuales, y modelando la relación entre dichos atributos y el éxito comercial de las ofertas. Además, P\u0026G utiliza los datos y la analítica de grupos de interés, redes sociales, mercados de prueba y avances de salida en tiendas para planificar, producir y lanzar nuevos productos.\n\n####Mantenimiento predictivo\nLos factores capaces de predecir fallos mecánicos pueden estar profundamente ocultos entre datos estructurados (año del equipo, marca o modelo de una máquina) o entre datos no estructurados que cubren millones de entradas de registros, datos de sensores, mensajes de error y temperaturas de motor. Al analizar estos indicadores de problemas potenciales antes de que estos se produzcan, las organizaciones pueden implantar el mantenimiento de una forma más rentable y optimizar el tiempo de servicio de componentes y equipos.\n\n####Experiencia del cliente\nLa carrera para conseguir clientes ha comenzado. Disponer de una vista clara de la experiencia del cliente es más posible que nunca. El big data le permite recopilar datos de redes sociales, visitas a páginas web, registros de llamadas y otras fuentes de datos para mejorar la experiencia de interacción, así como maximizar el valor ofrecido. Empiece a formular ofertas personalizadas, reducir las tasas de abandono de los clientes y gestionar las incidencias de manera proactiva.\n\n####Fraude y conformidad\nEn lo que a seguridad se refiere, no se enfrenta a simples piratas informáticos deshonestos, sino a equipos completos de expertos. Los contextos de seguridad y requisitos de conformidad están en constante evolución. El big data le ayuda a identificar patrones en los datos que pueden ser indicativos de fraude, al tiempo que concentra grandes volúmenes de información para agilizar la generación de informes normativos.\n\n####Aprendizaje automático (Machine Learning)\nEl aprendizaje automático es actualmente un tema de gran actualidad. Los datos —concretamente big data— son uno de los motivos de que así sea. Ahora, en lugar de programarse, las máquinas pueden aprender. Esto es posible gracias a la disponibilidad de big data para crear modelos de aprendizaje automático.\n\n####Eficiencia operativa\nPuede que la eficiencia operativa no sea el aspecto más destacado en los titulares, pero es el área en que big data tiene un mayor impacto. El big data le permite analizar y evaluar la producción, la opinión de los clientes, las devoluciones y otros factores para reducir las situaciones de falta de stock y anticipar la demanda futura. El big data también puede utilizarse para mejorar la toma de decisiones en función de la demanda de mercado en cada momento.\n\n####Impulso de la innovación\nEl big data puede ayudarle a innovar mediante el estudio de las interdependencias entre seres humanos, instituciones, entidades y procesos, y, posteriormente, mediante la determinación de nuevas formas de usar dicha información. Utilice las perspectivas que le ofrecen los datos para mejorar sus decisiones financieras y consideraciones de planificación. Estudie las tendencias y lo que desean los clientes para ofrecer nuevos productos y servicios. Implante políticas de precios dinámicas. Las posibilidades son infinitas.\n\n###Desafíos de big data\n\nSi bien es cierto que el big data promete mucho, también se enfrenta a desafíos.\n\nEn primer lugar, el big data se caracteriza por su gran tamaño. Aunque se han desarrollado nuevas tecnologías para el almacenamiento de datos, el volumen de datos duplica su tamaño cada dos años aproximadamente. Las organizaciones continúan esforzándose por mantener el ritmo de crecimiento de sus datos y por encontrar formas de almacenarlos eficazmente.\n\nPero no basta con almacenar los datos. Para ser de algún valor, los datos deben poder utilizarse, y esto depende de su conservación. Disponer de datos limpios —es decir, datos relevantes para el cliente y organizados de tal modo que permitan un análisis significativo— requiere una gran cantidad de trabajo. Los científicos de datos dedican entre un 50 y un 80 por ciento de su tiempo a seleccionar y preparar los datos antes de que estos puedan utilizarse.\n\nPor último, la tecnología de big data cambia a un ritmo rápido. Hace unos años, Apache Hadoop era la tecnología más conocida utilizada para gestionar big data. Más tarde, en 2014, entraría en juego Apache Spark. Hoy en día, el enfoque óptimo parece ser una combinación de ambos frameworks. Mantenerse al día en cuanto a tecnología de big data supone un desafío constante.\n\n###¿Cómo funciona big data?\n\nEl big data le aporta nuevas perspectivas que abren paso a nuevas oportunidades y modelos de negocio. Iniciarse en ello requiere de tres acciones clave:\n\n####Integrar\n\nEl big data concentra datos de numerosas fuentes y aplicaciones distintas. Los mecanismos de integración de datos convencionales, tales como ETL (extract, transform, load [extraer, transformar, cargar]), generalmente no están a la altura en dicha tarea. Analizar conjuntos de big data de uno o más terabytes, o incluso petabytes, de tamaño requiere de nuevas estrategias y tecnologías.\n\nDurante la integración, es necesario incorporar los datos, procesarlos y asegurarse de que estén formateados y disponibles de tal forma que los analistas empresariales puedan empezar a utilizarlos.\n\n####Gestionar\n\nEl big data requiere almacenamiento. Su solución de almacenamiento puede residir en la nube, on premise o ambas. Puede almacenar sus datos de cualquier forma que desee e incorporar los requisitos de procesamiento de su preferencia y los motores de procesamiento necesarios a dichos conjuntos de datos on-demand. Muchas personas eligen su solución de almacenamiento en función de dónde residan sus datos en cada momento. La nube está aumentando progresivamente su popularidad porque es compatible con sus requisitos tecnológicos actuales y porque le permite incorporar recursos a medida que los necesita.\n\n\n####Analizar\n\nLa inversión en big data se rentabiliza en cuanto se analizan y utilizan los datos. Adquiera una nueva claridad con un análisis visual de sus diversos conjuntos de datos. Continúe explorando los datos para realizar nuevos descubrimientos. Comparta sus hallazgos con otras personas. Construya modelos de datos con aprendizaje automático e inteligencia artificial. Ponga sus datos a trabajar.\n\n###Mejores prácticas de big data\n\nPara ayudarle en su transición a big data, hemos recopilado una serie de mejores prácticas que debe tener en cuenta. A continuación, detallamos nuestras pautas para crear con éxito una base de big data.\n\n\n####Alinear big data con objetivos empresariales específicos \t\n\nLa disponibilidad de conjuntos de datos más amplios le permite realizar nuevos hallazgos. A tal efecto, es importante basar las nuevas inversiones en habilidades, organización o infraestructura con un marcado contexto empresarial para garantizar la constancia en la financiación e inversión en proyectos. Para determinar si se encuentra en el camino correcto, pregúntese en qué medida el big data respalda y habilita sus principales prioridades empresariales y de TI. Algunos ejemplos incluyen entender cómo filtrar los registros web para comprender el comportamiento del comercio electrónico, extraer el sentimiento de las redes sociales y de las interacciones de atención al cliente, así como entender los métodos de correlación estadística y su relevancia para los datos de clientes, productos, fabricación e ingeniería.\n\n####Facilite la escasez de habilidades con estándares y administración \t\n\nUno de los mayores obstáculos del big data es la escasez de habilidades. Puede mitigar el riesgo asegurándose de incorporar a su programa de administración de TI tecnologías, consideraciones y decisiones relativas a big data. Normalizar su enfoque le permitirá gestionar los costes y aprovechar los recursos. Las organizaciones que implanten soluciones y estrategias de big data deben evaluar sus necesidades de habilidades de forma temprana y frecuente, e identificar de manera proactiva las posibles carencias de habilidades. Esto puede lograrse mediante la impartición de formación o la formación cruzada entre recursos existentes, la contratación de nuevos recursos y el uso de empresas de consultoría.\n\n####Optimizar la transferencia de conocimientos con un centro de excelencia \t\n\nUtilice un enfoque basado en un centro de excelencia para compartir conocimientos, supervisar el control y gestionar las comunicaciones de proyectos. Tanto si el big data es una inversión nueva o en expansión, los costes directos e indirectos pueden distribuirse en toda la empresa. Utilizar este enfoque puede contribuir a incrementar las capacidades de big data y la madurez del conjunto de la arquitectura de información de una forma más sistemática y estructurada.\n\n####La principal ventaja reside en alinear los datos estructurados y no estructurados \t\n\nAnalizar el big data de forma aislada sin duda aporta valor. Sin embargo, puede obtener una perspectiva empresarial aún más valiosa relacionando e integrando el big data de baja densidad con los datos estructurados que ya usa actualmente.\n\nTanto si está recopilando big data de clientes, de productos, de equipos o ambientales, el objetivo es añadir puntos de datos más relevantes a sus resúmenes maestros y analíticos, lo que le permitirá obtener mejores conclusiones. Por ejemplo, existe una diferencia en distinguir la percepción de todos los clientes de la de solo sus mejores clientes. Por eso, muchos consideran que big data constituye una extensión integral de sus capacidades existentes de inteligencia empresarial, de su plataforma de almacenamiento de datos y de su arquitectura de información.\n\nTenga en cuenta que los modelos y procesos analíticos de big data pueden ser tanto humanos como automáticos. Las capacidades de análisis de big data incluyen estadísticas, análisis especiales, semántica, detección interactiva y visualización. Mediante el uso de modelos analíticos, puede relacionar distintos tipos y fuentes de datos para realizar asociaciones y hallazgos significativos.\n\n####Planificar el laboratorio de hallazgos en pro del rendimiento \t\n\nEl concepto \"hallazgo\" implica que los datos no siempre se obtienen directamente. En ocasiones, ni siquiera sabemos qué estamos buscando. Eso es de esperar. La dirección y los equipos de TI deben respaldar esta “falta de dirección” o “falta de claridad en los requisitos.”\n\nAl mismo tiempo, es importante que analistas y científicos de datos colaboren estrechamente con la empresa para entender las principales necesidades y carencias de conocimientos de la empresa. Para incorporar el estudio interactivo de los datos y la experimentación de algoritmos estadísticos, necesita contar con áreas de trabajo de alto rendimiento. Asegúrese de que los entornos de pruebas (sandbox) tienen la potencia necesaria y están correctamente gobernados.\n\n####Alineación con el modelo operativo en la nube \t\n\nLos usuarios y procesos de big data requieren acceso a una amplia variedad de recursos de experimentación reiterativa y ejecución de tareas de producción. Una solución de big data incluye todos los ámbitos de los datos, incluidas transacciones, datos principales, datos de referencia y datos resumidos. Los entornos de pruebas (sandboxes) analíticos deben crearse on-demand. La gestión de recursos es fundamental para garantizar el control de todo el flujo de datos, incluido el procesamiento previo y posterior, la integración, el resumen dentro de la base de datos y la creación de modelos analíticos. Disponer de una estrategia bien definida de aprovisionamiento y seguridad en la nube pública y privada es fundamental para respaldar estos requisitos cambiantes.\n\n    ",
      "user": "anonymous",
      "dateUpdated": "Jul 3, 2018 8:41:26 PM",
      "config": {
        "tableHide": false,
        "editorSetting": {
          "language": "markdown",
          "editOnDblClick": true
        },
        "colWidth": 12.0,
        "editorMode": "ace/mode/markdown",
        "editorHide": true,
        "results": {},
        "enabled": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "results": {
        "code": "SUCCESS",
        "msg": [
          {
            "type": "HTML",
            "data": "\u003ch1\u003e¿Qué es big data?\u003c/h1\u003e\n\u003cp\u003eA lo largo de los ultimos años se han creado diferentes definiciones de big data, una de las más aceptadas es la de \u003ca href\u003d\"https://www.gartner.com/it-glossary/big-data\"\u003eGartner(2001)\u003c/a\u003e:\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026ldquo;Big Data son activos de información de gran volumen, alta velocidad y gran variedad, que demandan formas rentables e innovadoras de procesamiento, lo que permiten un mejor conocimiento, toma de decisiones y automatización de procesos\u0026rdquo;\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eDicho de otro modo, big data está formado por conjuntos de datos de mayor tamaño y más complejos que los tradicionales, especialmente procedentes de nuevas fuentes de datos. Estos conjuntos de datos son tan voluminosos que el software de procesamiento de datos convencional sencillamente no puede gestionarlos. Sin embargo, estos volúmenes masivos de datos pueden utilizarse para abordar problemas que antes no hubiera sido posible solucionar.\u003c/p\u003e\n\u003ch3\u003eLas tres V\u0027s de big data\u003c/h3\u003e\n\u003cp align\u003d\"center\"\u003e\n  \u003cimg width\u003d\"460\" height\u003d\"300\" src\u003d\"https://www.whishworks.com/hs-fs/hubfs/Blog/The-3Vs-of-big-data.png?t\u003d1530105246202\u0026width\u003d618\u0026name\u003dThe-3Vs-of-big-data.png\"\u003e\n\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVolumen\u003c/strong\u003e: Con big data se procesan grandes volúmenes de datos no estructurados de baja densidad, puede tratarse de datos de valor desconocido, como publicaciones de usuarios en una red social, registros de clics en una página web o aplicación para móviles o dispositivos con diferentes sensores. Para algunas organizaciones, esto puede suponer decenas de terabytes de datos. Para otras, incluso cientos de petabytes.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVelocidad\u003c/strong\u003e: La velocidad es el ritmo al que se reciben los datos y posiblemente al que se aplica alguna acción. Los datos con mayor velocidad normalmente se transmiten directamente a la memoria, en vez de escribirse en un disco. Algunos productos con conexión a internet reciben información constantemente y requieren una evaluación y procesamiento en tiempo real.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVariedad\u003c/strong\u003e: La variedad hace referencia a los diversos tipos de datos disponibles. Los tipos de datos convencionales eran estructurados y podían organizarse facilmente en una base de datos relacional. Con el auge del big data, los datos se presentan en nuevos tipos de datos no estructurados. Los tipos de datos no estructurados y semiestructurados, como el texto, audio o vídeo, requieren de un preprocesamiento adicional para poder obtener significado.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eOtras caracteristicas\u003c/h3\u003e\n\u003cp\u003ePara muchos, los anteriores 3 aspectos no son suficientes para describir Big Data, es por esto que en los últimos años se han identificado otras caracteristicas de big data (que también comienzan con la letra V), desde las originales \u003ca href\u003d\"https://blogs.gartner.com/doug-laney/files/2012/01/ad949-3D-Data-Management-Controlling-Data-Volume-Velocity-and-Variety.pdf\"\u003e3 V\u0027s\u003c/a\u003e se ha llegado a hablar de \u003ca href\u003d\"http://www.ibmbigdatahub.com/infographic/four-vs-big-data\"\u003e4 V\u0027s\u003c/a\u003e, \u003ca href\u003d\"https://www.wired.com/insights/2013/05/the-missing-vs-in-big-data-viability-and-value/\"\u003e5 V\u0027s\u003c/a\u003e, \u003ca href\u003d\"https://insidebigdata.com/2013/09/12/beyond-volume-variety-velocity-issue-big-data-veracity/\"\u003e6 V\u0027s\u003c/a\u003e, \u003ca href\u003d\"https://datafloq.com/read/3vs-sufficient-describe-big-data/166\"\u003e7 V\u0027s\u003c/a\u003e, \u003ca href\u003d\"https://mapr.com/blog/top-10-big-data-challenges-serious-look-10-big-data-vs/\"\u003e10 V\u0027s\u003c/a\u003e e incluso se han llegado a describir \u003ca href\u003d\"https://www.elderresearch.com/blog/42-v-of-big-data\"\u003e42 V\u0027s\u003c/a\u003e, a continuación se describen algunas de las V\u0027s adicionales:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVeracidad\u003c/strong\u003e: Tener una gran cantidad de datos de gran volumen entrando a alta velocidad no tiene valor si esos datos son incorrectos. Los datos incorrectos pueden causar muchos problemas tanto para las organizaciones como para los consumidores. Por lo tanto, las organizaciones deben garantizar que los datos sean correctos y que los análisis realizados sobre los datos sean correctos. Especialmente en la toma de decisiones automatizada, donde ya no interviene ningún ser humano, debe asegurarse de que tanto los datos como los análisis sean correctos.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVariabilidad\u003c/strong\u003e: Big data es extremadamente variable. Brian Hopkins, un analista principal de Forrester, define la variabilidad como la \u0026ldquo;varianza en el significado, en el léxico\u0026rdquo;. Se refiere a la supercomputadora Watson que ganó Jeopardy. La supercomputadora tuvo que \u0026ldquo;diseccionar una respuesta en su significado y [\u0026hellip;] averiguar cuál era la pregunta correcta\u0026rdquo;. Eso es extremadamente difícil porque las palabras tienen diferentes significados y todo depende del contexto. Para la respuesta correcta, Watson tuvo que entender el contexto.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVisualización\u003c/strong\u003e: Hacer que toda esa gran cantidad de datos comprensibles de una manera que sea fácil de entender y leer. Con los análisis y visualizaciones correctos, los datos brutos pueden utilizarse, de lo contrario, los datos en bruto permanecen esencialmente inútiles. Las visualizaciones, por supuesto, no significan gráficos ordinarios o gráficos circulares. Significan gráficos complejos que pueden incluir muchas variables de datos mientras siguen siendo comprensibles y legibles.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eValor\u003c/strong\u003e: Los datos poseen un valor intrínseco. Sin embargo, no tienen ninguna utilidad hasta que dicho valor se descubre. Hoy en día, el big data se ha convertido en un activo crucial. Piense en algunas de las mayores empresas tecnológicas del mundo. Gran parte del valor que ofrecen procede de sus datos, que analizan constantemente para generar una mayor eficiencia y desarrollar nuevos productos. Avances tecnológicos recientes han reducido exponencialmente el coste del almacenamiento y la computación de datos, haciendo que almacenar datos resulte más fácil y barato que nunca. Identificar el valor del big data no pasa solo por analizarlo (que es ya una ventaja en sí misma). Se trata de todo un proceso de descubrimiento que requiere que los analistas, usuarios empresariales y ejecutivos se planteen las preguntas correctas, identifiquen patrones, tomen decisiones informadas y predigan comportamientos.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eLa historia de big data\u003c/h3\u003e\n\u003cp\u003eSi bien el concepto \u0026ldquo;big data\u0026rdquo; en sí mismo es relativamente nuevo, los orígenes de los grandes conjuntos de datos se remontan a las décadas de 1960 y 1970, donde se sitúan los origines de este universo con los primeros centros de datos y el desarrollo de las bases de datos relacionales.\u003c/p\u003e\n\u003cp\u003eAlrededor de 2005, la gente empezó a darse cuenta de la cantidad de datos que generaban los usuarios a través de Facebook, YouTube y otros servicios online. Ese mismo año, se desarrollaría Hadoop, un marco de código abierto creado específicamente para almacenar y analizar grandes conjuntos de datos. En esta época, también empezaría a adquirir popularidad NoSQL.\u003c/p\u003e\n\u003cp\u003eEl desarrollo de Framewoks de código abierto tales como Hadoop (y, más recientemente, Spark) sería esencial para el crecimiento del big data, pues estos hacían que el big data resultase más fácil de usar y más barato de almacenar. En los años siguientes, el volumen de big data se ha disparado. Los usuarios continúan generando enormes cantidades de datos, pero ahora los humanos no son los únicos que lo hacen.\u003c/p\u003e\n\u003cp\u003eCon la llegada del Internet de las cosas (IoT), hay un mayor número de objetos y dispositivos conectados a Internet que generan datos sobre patrones de uso de los clientes y rendimiento de los productos. El surgimiento del aprendizaje automático ha producido aún más datos.\u003c/p\u003e\n\u003cp\u003eAunque el big data ha llegado lejos, su utilidad no ha hecho más que empezar. El Cloud Computing ha ampliado aún más las posibilidades del big data. La nube ofrece una escalabilidad realmente elástica, donde los desarrolladores pueden simplemente agilizar clústeres ad hoc para probar un subconjunto de datos.\u003c/p\u003e\n\u003ch3\u003eVentajas de big data y de la analítica de datos\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eMejora de la toma de decisiones: Con el Big Data se pueden analizar datos pasados para hacer predicciones sobre el futuro. Por lo tanto, las empresas no solo pueden tomar mejores decisiones para su día a día, sino también prepararse para el futuro. Esto les da una ventaja competitiva y proporciona un marco más ágil para la toma de decisiones y el manejo de riesgos.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eReducción de costes: Big Data proporciona la inteligencia empresarial necesaria para reducir costes y mejorar la eficiencia de las operaciones. El análisis de Big Data puede proporcionar información sobre el impacto de diferentes variables en el proceso de producción, ayudando así a las industrias a tomar mejores decisiones.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eNuevos productos y servicios: Analizando los datos pasados sobre lanzamientos de productos y cruzando esos datos con datos de opiniones de clientes es posible mejorar los nuevos productos que pretendemos lanzar en el futuro. Además de esto, el análisis de mercado en tiempo real permite a las empresas comprender los cambios en la demanda y en el comportamiento de los consumidores lo que ayuda a una comercialización orientada al cliente. Una mayor demanda de servicios personalizados también puede potenciarse mediante el análisis de las necesidades del consumidor, las preferencias y los comportamientos de compra.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eFeedback a tiempo real: Incluso en los momentos en los que es necesario tomar una decisión inmediata, el Big Data es un arma muy poderosa puesto que permite recibir y procesar los datos a tiempo real y contar con la información necesaria rápidamente. El Big Data es por encima de todo una tecnología ágil y veloz que permite permite por ejemplo obtener información a tiempo real del lanzamiento de un producto o el resultado de una estrategia.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eConocimiento del mercado: El conocimiento del mercado en el que se opera puede ayudar no solo a la toma de decisiones, sino también a la localización de posibles oportunidades mediante el tratamiento de estos datos estructurados y comparables. También puede ayudar a predecir posibles escenarios e incluso a conocer mejor a a los consumidores, mediante un análisis segmentado.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eCasos de uso de big data\u003c/h3\u003e\n\u003cp\u003eEl big data puede ayudarle a abordar una serie de actividades empresariales, desde la experiencia de cliente hasta la analítica. A continuación, recopilamos algunas de ellas\u003c/p\u003e\n\u003ch4\u003eDesarrollo de productos\u003c/h4\u003e\n\u003cp\u003eEmpresas como Netflix y Procter \u0026amp; Gamble usan big data para prever la demanda de los clientes. Construyen modelos predictivos para nuevos productos y servicios clasificando atributos clave de productos anteriores y actuales, y modelando la relación entre dichos atributos y el éxito comercial de las ofertas. Además, P\u0026amp;G utiliza los datos y la analítica de grupos de interés, redes sociales, mercados de prueba y avances de salida en tiendas para planificar, producir y lanzar nuevos productos.\u003c/p\u003e\n\u003ch4\u003eMantenimiento predictivo\u003c/h4\u003e\n\u003cp\u003eLos factores capaces de predecir fallos mecánicos pueden estar profundamente ocultos entre datos estructurados (año del equipo, marca o modelo de una máquina) o entre datos no estructurados que cubren millones de entradas de registros, datos de sensores, mensajes de error y temperaturas de motor. Al analizar estos indicadores de problemas potenciales antes de que estos se produzcan, las organizaciones pueden implantar el mantenimiento de una forma más rentable y optimizar el tiempo de servicio de componentes y equipos.\u003c/p\u003e\n\u003ch4\u003eExperiencia del cliente\u003c/h4\u003e\n\u003cp\u003eLa carrera para conseguir clientes ha comenzado. Disponer de una vista clara de la experiencia del cliente es más posible que nunca. El big data le permite recopilar datos de redes sociales, visitas a páginas web, registros de llamadas y otras fuentes de datos para mejorar la experiencia de interacción, así como maximizar el valor ofrecido. Empiece a formular ofertas personalizadas, reducir las tasas de abandono de los clientes y gestionar las incidencias de manera proactiva.\u003c/p\u003e\n\u003ch4\u003eFraude y conformidad\u003c/h4\u003e\n\u003cp\u003eEn lo que a seguridad se refiere, no se enfrenta a simples piratas informáticos deshonestos, sino a equipos completos de expertos. Los contextos de seguridad y requisitos de conformidad están en constante evolución. El big data le ayuda a identificar patrones en los datos que pueden ser indicativos de fraude, al tiempo que concentra grandes volúmenes de información para agilizar la generación de informes normativos.\u003c/p\u003e\n\u003ch4\u003eAprendizaje automático (Machine Learning)\u003c/h4\u003e\n\u003cp\u003eEl aprendizaje automático es actualmente un tema de gran actualidad. Los datos —concretamente big data— son uno de los motivos de que así sea. Ahora, en lugar de programarse, las máquinas pueden aprender. Esto es posible gracias a la disponibilidad de big data para crear modelos de aprendizaje automático.\u003c/p\u003e\n\u003ch4\u003eEficiencia operativa\u003c/h4\u003e\n\u003cp\u003ePuede que la eficiencia operativa no sea el aspecto más destacado en los titulares, pero es el área en que big data tiene un mayor impacto. El big data le permite analizar y evaluar la producción, la opinión de los clientes, las devoluciones y otros factores para reducir las situaciones de falta de stock y anticipar la demanda futura. El big data también puede utilizarse para mejorar la toma de decisiones en función de la demanda de mercado en cada momento.\u003c/p\u003e\n\u003ch4\u003eImpulso de la innovación\u003c/h4\u003e\n\u003cp\u003eEl big data puede ayudarle a innovar mediante el estudio de las interdependencias entre seres humanos, instituciones, entidades y procesos, y, posteriormente, mediante la determinación de nuevas formas de usar dicha información. Utilice las perspectivas que le ofrecen los datos para mejorar sus decisiones financieras y consideraciones de planificación. Estudie las tendencias y lo que desean los clientes para ofrecer nuevos productos y servicios. Implante políticas de precios dinámicas. Las posibilidades son infinitas.\u003c/p\u003e\n\u003ch3\u003eDesafíos de big data\u003c/h3\u003e\n\u003cp\u003eSi bien es cierto que el big data promete mucho, también se enfrenta a desafíos.\u003c/p\u003e\n\u003cp\u003eEn primer lugar, el big data se caracteriza por su gran tamaño. Aunque se han desarrollado nuevas tecnologías para el almacenamiento de datos, el volumen de datos duplica su tamaño cada dos años aproximadamente. Las organizaciones continúan esforzándose por mantener el ritmo de crecimiento de sus datos y por encontrar formas de almacenarlos eficazmente.\u003c/p\u003e\n\u003cp\u003ePero no basta con almacenar los datos. Para ser de algún valor, los datos deben poder utilizarse, y esto depende de su conservación. Disponer de datos limpios —es decir, datos relevantes para el cliente y organizados de tal modo que permitan un análisis significativo— requiere una gran cantidad de trabajo. Los científicos de datos dedican entre un 50 y un 80 por ciento de su tiempo a seleccionar y preparar los datos antes de que estos puedan utilizarse.\u003c/p\u003e\n\u003cp\u003ePor último, la tecnología de big data cambia a un ritmo rápido. Hace unos años, Apache Hadoop era la tecnología más conocida utilizada para gestionar big data. Más tarde, en 2014, entraría en juego Apache Spark. Hoy en día, el enfoque óptimo parece ser una combinación de ambos frameworks. Mantenerse al día en cuanto a tecnología de big data supone un desafío constante.\u003c/p\u003e\n\u003ch3\u003e¿Cómo funciona big data?\u003c/h3\u003e\n\u003cp\u003eEl big data le aporta nuevas perspectivas que abren paso a nuevas oportunidades y modelos de negocio. Iniciarse en ello requiere de tres acciones clave:\u003c/p\u003e\n\u003ch4\u003eIntegrar\u003c/h4\u003e\n\u003cp\u003eEl big data concentra datos de numerosas fuentes y aplicaciones distintas. Los mecanismos de integración de datos convencionales, tales como ETL (extract, transform, load [extraer, transformar, cargar]), generalmente no están a la altura en dicha tarea. Analizar conjuntos de big data de uno o más terabytes, o incluso petabytes, de tamaño requiere de nuevas estrategias y tecnologías.\u003c/p\u003e\n\u003cp\u003eDurante la integración, es necesario incorporar los datos, procesarlos y asegurarse de que estén formateados y disponibles de tal forma que los analistas empresariales puedan empezar a utilizarlos.\u003c/p\u003e\n\u003ch4\u003eGestionar\u003c/h4\u003e\n\u003cp\u003eEl big data requiere almacenamiento. Su solución de almacenamiento puede residir en la nube, on premise o ambas. Puede almacenar sus datos de cualquier forma que desee e incorporar los requisitos de procesamiento de su preferencia y los motores de procesamiento necesarios a dichos conjuntos de datos on-demand. Muchas personas eligen su solución de almacenamiento en función de dónde residan sus datos en cada momento. La nube está aumentando progresivamente su popularidad porque es compatible con sus requisitos tecnológicos actuales y porque le permite incorporar recursos a medida que los necesita.\u003c/p\u003e\n\u003ch4\u003eAnalizar\u003c/h4\u003e\n\u003cp\u003eLa inversión en big data se rentabiliza en cuanto se analizan y utilizan los datos. Adquiera una nueva claridad con un análisis visual de sus diversos conjuntos de datos. Continúe explorando los datos para realizar nuevos descubrimientos. Comparta sus hallazgos con otras personas. Construya modelos de datos con aprendizaje automático e inteligencia artificial. Ponga sus datos a trabajar.\u003c/p\u003e\n\u003ch3\u003eMejores prácticas de big data\u003c/h3\u003e\n\u003cp\u003ePara ayudarle en su transición a big data, hemos recopilado una serie de mejores prácticas que debe tener en cuenta. A continuación, detallamos nuestras pautas para crear con éxito una base de big data.\u003c/p\u003e\n\u003ch4\u003eAlinear big data con objetivos empresariales específicos\u003c/h4\u003e\n\u003cp\u003eLa disponibilidad de conjuntos de datos más amplios le permite realizar nuevos hallazgos. A tal efecto, es importante basar las nuevas inversiones en habilidades, organización o infraestructura con un marcado contexto empresarial para garantizar la constancia en la financiación e inversión en proyectos. Para determinar si se encuentra en el camino correcto, pregúntese en qué medida el big data respalda y habilita sus principales prioridades empresariales y de TI. Algunos ejemplos incluyen entender cómo filtrar los registros web para comprender el comportamiento del comercio electrónico, extraer el sentimiento de las redes sociales y de las interacciones de atención al cliente, así como entender los métodos de correlación estadística y su relevancia para los datos de clientes, productos, fabricación e ingeniería.\u003c/p\u003e\n\u003ch4\u003eFacilite la escasez de habilidades con estándares y administración\u003c/h4\u003e\n\u003cp\u003eUno de los mayores obstáculos del big data es la escasez de habilidades. Puede mitigar el riesgo asegurándose de incorporar a su programa de administración de TI tecnologías, consideraciones y decisiones relativas a big data. Normalizar su enfoque le permitirá gestionar los costes y aprovechar los recursos. Las organizaciones que implanten soluciones y estrategias de big data deben evaluar sus necesidades de habilidades de forma temprana y frecuente, e identificar de manera proactiva las posibles carencias de habilidades. Esto puede lograrse mediante la impartición de formación o la formación cruzada entre recursos existentes, la contratación de nuevos recursos y el uso de empresas de consultoría.\u003c/p\u003e\n\u003ch4\u003eOptimizar la transferencia de conocimientos con un centro de excelencia\u003c/h4\u003e\n\u003cp\u003eUtilice un enfoque basado en un centro de excelencia para compartir conocimientos, supervisar el control y gestionar las comunicaciones de proyectos. Tanto si el big data es una inversión nueva o en expansión, los costes directos e indirectos pueden distribuirse en toda la empresa. Utilizar este enfoque puede contribuir a incrementar las capacidades de big data y la madurez del conjunto de la arquitectura de información de una forma más sistemática y estructurada.\u003c/p\u003e\n\u003ch4\u003eLa principal ventaja reside en alinear los datos estructurados y no estructurados\u003c/h4\u003e\n\u003cp\u003eAnalizar el big data de forma aislada sin duda aporta valor. Sin embargo, puede obtener una perspectiva empresarial aún más valiosa relacionando e integrando el big data de baja densidad con los datos estructurados que ya usa actualmente.\u003c/p\u003e\n\u003cp\u003eTanto si está recopilando big data de clientes, de productos, de equipos o ambientales, el objetivo es añadir puntos de datos más relevantes a sus resúmenes maestros y analíticos, lo que le permitirá obtener mejores conclusiones. Por ejemplo, existe una diferencia en distinguir la percepción de todos los clientes de la de solo sus mejores clientes. Por eso, muchos consideran que big data constituye una extensión integral de sus capacidades existentes de inteligencia empresarial, de su plataforma de almacenamiento de datos y de su arquitectura de información.\u003c/p\u003e\n\u003cp\u003eTenga en cuenta que los modelos y procesos analíticos de big data pueden ser tanto humanos como automáticos. Las capacidades de análisis de big data incluyen estadísticas, análisis especiales, semántica, detección interactiva y visualización. Mediante el uso de modelos analíticos, puede relacionar distintos tipos y fuentes de datos para realizar asociaciones y hallazgos significativos.\u003c/p\u003e\n\u003ch4\u003ePlanificar el laboratorio de hallazgos en pro del rendimiento\u003c/h4\u003e\n\u003cp\u003eEl concepto \u0026ldquo;hallazgo\u0026rdquo; implica que los datos no siempre se obtienen directamente. En ocasiones, ni siquiera sabemos qué estamos buscando. Eso es de esperar. La dirección y los equipos de TI deben respaldar esta “falta de dirección” o “falta de claridad en los requisitos.”\u003c/p\u003e\n\u003cp\u003eAl mismo tiempo, es importante que analistas y científicos de datos colaboren estrechamente con la empresa para entender las principales necesidades y carencias de conocimientos de la empresa. Para incorporar el estudio interactivo de los datos y la experimentación de algoritmos estadísticos, necesita contar con áreas de trabajo de alto rendimiento. Asegúrese de que los entornos de pruebas (sandbox) tienen la potencia necesaria y están correctamente gobernados.\u003c/p\u003e\n\u003ch4\u003eAlineación con el modelo operativo en la nube\u003c/h4\u003e\n\u003cp\u003eLos usuarios y procesos de big data requieren acceso a una amplia variedad de recursos de experimentación reiterativa y ejecución de tareas de producción. Una solución de big data incluye todos los ámbitos de los datos, incluidas transacciones, datos principales, datos de referencia y datos resumidos. Los entornos de pruebas (sandboxes) analíticos deben crearse on-demand. La gestión de recursos es fundamental para garantizar el control de todo el flujo de datos, incluido el procesamiento previo y posterior, la integración, el resumen dentro de la base de datos y la creación de modelos analíticos. Disponer de una estrategia bien definida de aprovisionamiento y seguridad en la nube pública y privada es fundamental para respaldar estos requisitos cambiantes.\u003c/p\u003e\n"
          }
        ]
      },
      "apps": [],
      "jobName": "paragraph_1530217032261_461755327",
      "id": "20180626-180847_967833253",
      "dateCreated": "Jun 28, 2018 8:17:12 PM",
      "dateStarted": "Jul 3, 2018 8:41:26 PM",
      "dateFinished": "Jul 3, 2018 8:41:26 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "text": "",
      "dateUpdated": "Jun 28, 2018 8:17:12 PM",
      "config": {
        "colWidth": 12.0,
        "editorMode": "ace/mode/markdown",
        "results": {},
        "enabled": true,
        "editorSetting": {
          "editOnDblClick": true,
          "language": "markdown"
        }
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "apps": [],
      "jobName": "paragraph_1530217032262_462909573",
      "id": "20180626-210142_1608139983",
      "dateCreated": "Jun 28, 2018 8:17:12 PM",
      "status": "READY",
      "errorMessage": "",
      "progressUpdateIntervalMs": 500
    }
  ],
  "name": "Introducción",
  "id": "2DJSYDJNY",
  "angularObjects": {
    "2CHS8UYQQ:shared_process": [],
    "2C8A4SZ9T_livy2:shared_process": [],
    "2CK8A9MEG:shared_process": [],
    "2C4U48MY3_spark2:shared_process": [],
    "2CKAY1A8Y:shared_process": [],
    "2CKEKWY8Z:shared_process": []
  },
  "config": {},
  "info": {}
}