{
  "paragraphs": [
    {
      "text": "%md\n\n# ¿Qué es Big Data?\n\nSe han creado diferentes definiciones de Big Data, una de las más antiguas y que aún es considerada como la definición de referencia es la de [Gartner(2001)](https://www.gartner.com/it-glossary/big-data):\n\n***\"Big Data son activos de información de gran volumen, alta velocidad y gran variedad, que demandan formas rentables e innovadoras de procesamiento, lo que permiten un mejor conocimiento, toma de decisiones y automatización de procesos\".***\n\nDicho de otro modo, Big Data está formado por conjuntos de datos de mayor tamaño y más complejos, especialmente procedentes de nuevas fuentes de datos. Estos conjuntos de datos son tan voluminosos que el software de procesamiento de datos convencional sencillamente no puede gestionarlos. Sin embargo, estos volúmenes masivos de datos pueden utilizarse para abordar problemas que antes no hubiera sido posible solucionar. Big Data no son solo datos, sino que se ha convertido en un tema completo, que involucra diversas herramientas, técnicas y frameworks.\n\n---\n\n## Las V\u0027s de Big Data\n\n\u003cp align\u003d\"center\"\u003e\n  \u003cimg width\u003d\"460\" height\u003d\"300\" src\u003d\"https://1.bp.blogspot.com/-4PXnx5bSWO8/WH2-DfIpFZI/AAAAAAAAAg4/efnThIh6esMYtjYxwoktHFNmRrDiX5MqQCLcB/s640/7Vs_of_Big_Data.PNG\"\u003e\n\u003c/p\u003e\n\nCon la definición dada por Gartner se definieron 3 características claves de Big Data, las cuales se denominaron las 3 V\u0027s de Big Data.\n\n* **Volumen**: Esta es la característica principal que define a Big Data como \"Big\". Todos los días se procesan grandes volúmenes de datos los cuales puede poseer un valor desconocido, como publicaciones de usuarios en una red social, registros de clics en una página web o aplicación para móviles o dispositivos con diferentes sensores.  Con el crecimiento de los datos que se están generando y que se deben almacenar, encontramos que el almacenamiento en Gigabytes en realidad no es suficiente. Debido a esta razón, en el mundo de hoy se analizan desde decenas de Terabytes hasta en cientos de petabytes, Exabytes, Zettabytes y Yottabytes.\n\n* **Velocidad**: Se refiere a qué tan rápido se acceden y procesan los datos. Tradicionalmente se programaba que los datos fueran analizados y actualizados cada cierto periodo de tiempo, hoy en día, las tendencia se basa en el análisis de datos en tiempo real, por lo que las operaciones de datos en intervalos grandes no son en absoluto útiles.\n\n* **Variedad**: La variedad hace referencia a los diversos tipos de datos disponibles. Los tipos de datos convencionales eran estructurados y podían organizarse fácilmente en una base de datos relacional. La tendencia se dirige al análisis de datos que se presentan en como datos no estructurados. Los tipos de datos no estructurados y semiestructurados, como el texto, audio o vídeo, requieren de un pre procesamiento adicional para poder obtener significado.\n\nA medida que pasaron los años se determinó que los anteriores 3 aspectos no son suficientes para describir Big Data en su totalidad, es por esto que en los últimos años se han identificado otras características (que también comienzan con la letra V). Partiendo de las originales [3 V\u0027s](https://blogs.gartner.com/doug-laney/files/2012/01/ad949-3D-Data-Management-Controlling-Data-Volume-Velocity-and-Variety.pdf) se ha llegado a hablar de [4 V\u0027s](http://www.ibmbigdatahub.com/infographic/four-vs-big-data), [5 V\u0027s](https://www.wired.com/insights/2013/05/the-missing-vs-in-big-data-viability-and-value/), [6 V\u0027s](https://insidebigdata.com/2013/09/12/beyond-volume-variety-velocity-issue-big-data-veracity/), [7 V\u0027s](https://datafloq.com/read/3vs-sufficient-describe-big-data/166), [10 V\u0027s](https://mapr.com/blog/top-10-big-data-challenges-serious-look-10-big-data-vs/) e incluso se han llegado a describir [42 V\u0027s](https://www.elderresearch.com/blog/42-v-of-big-data), a continuación se describen algunas de las V\u0027s adicionales mayormente aceptadas:\n\n* **Veracidad**: Tener una gran cantidad de datos de gran volumen entrando a alta velocidad no tiene valor si esos datos son incorrectos. Los datos incorrectos pueden causar muchos problemas tanto para las organizaciones como para los consumidores. Por lo tanto, las organizaciones deben garantizar que los datos sean correctos y que los análisis realizados sobre los datos sean confiables. Especialmente en la toma de decisiones automatizada, donde ya no interviene ningún ser humano, debe asegurarse de que tanto los datos como los análisis sean acertados.\n\n* **Variabilidad**: La variabilidad se centra principalmente en comprender e interpretar correctamente los significados de los datos brutos que dependen del contexto. Esto se requiere principalmente cuando se trabaja en procesamiento del lenguaje natural. Por ejemplo, Hay algunas palabras que pueden tener múltiples significados y el significado exacto depende del contexto en que se utiliza, es importante que el significado exacto se interprete correctamente para realizar un análisis adecuado.\n\n* **Visualización**: se refiere a cómo se presentan los datos para la toma de decisiones, es hacer que toda esa gran cantidad de datos comprensibles de una manera que sea fácil de entender y leer. Con los análisis y visualizaciones correctos, los datos brutos pueden utilizarse, de lo contrario, los datos en bruto permanecen esencialmente inútiles. Las visualizaciones, por supuesto, no significan gráficos ordinarios o gráficos circulares. Significan gráficos complejos que pueden incluir muchas variables de datos mientras siguen siendo comprensibles y legibles.\n\n* **Valor**: Los datos poseen un valor intrínseco. Sin embargo, no tienen ninguna utilidad hasta que dicho valor se descubre. Hoy en día, gran parte del valor que ofrecen las grandes compañías tecnológicas procede de sus datos, que analizan constantemente para generar una mayor eficiencia y desarrollar nuevos productos. Identificar el valor de los datos se trata de todo un proceso de descubrimiento que requiere que los analistas, usuarios empresariales y ejecutivos se planteen las preguntas correctas, identifiquen patrones, tomen decisiones informadas y predigan comportamientos.\n\n---\n\n## La historia de Big Data\n\nSi bien el concepto \"Big Data\" en sí mismo es relativamente nuevo, los orígenes de los grandes conjuntos de datos se remontan a las décadas de 1960 y 1970, donde se sitúan los origines de este universo con los primeros centros de datos y el desarrollo de las bases de datos relacionales.\n\nAlrededor de 2005, la gente empezó a darse cuenta de la cantidad de datos que generaban los usuarios a través de Facebook, YouTube y otros servicios online. Ese mismo año, se desarrollaría Hadoop, un framework de código abierto creado específicamente para almacenar y analizar grandes conjuntos de datos. En esta época, también empezaría a adquirir popularidad NoSQL.\n\nEl desarrollo de Framewoks de código abierto tales como Hadoop y más recientemente Spark, sería esencial para el crecimiento de Big Data, pues estos hicieron que Big Data resultase más fácil de usar y más barato de almacenar. En los años siguientes, el volumen de Big Data se ha disparado. Los usuarios continúan generando enormes cantidades de datos, pero ahora los humanos no son los únicos que lo hacen.\n\nCon la llegada del Internet de las cosas (IoT), hay un mayor número de objetos y dispositivos conectados a Internet que generan datos sobre patrones de uso de los clientes y rendimiento de los productos.\n\nAunque Big Data ha llegado lejos, su utilidad no ha hecho más que empezar. El Cloud Computing ha ampliado aún más las posibilidades de Big Data. La nube ofrece una escalabilidad realmente elástica, donde los desarrolladores pueden simplemente crear clústeres remotos y ajustarlos a sus necesidades.\n\n---\n\n## Ciclo de vida de Big Data\n\n1. **Evaluación de caso comercial**\n\n    El comienzo del ciclo de vida de Big Data comienza con una evaluación sólida del caso comercial. Antes de que se pueda iniciar cualquier proyecto de Big Data, debe quedar claro cuáles deberían ser los objetivos comerciales y los resultados del análisis de datos. Se debe comenzar con el fin en mente y definir claramente los objetivos y los resultados deseados del proyecto. Se podrían realizar muchas formas diferentes de análisis de datos, pero ¿cuál es exactamente la razón para invertir tiempo y esfuerzo en el análisis de datos? Al igual que con cualquier buen caso comercial, la propuesta debe estar respaldada por datos financieros.\n\n2. **Identificación de datos**\n\n    La etapa de identificación de datos determina el origen de los datos. Antes de analizar los datos, es importante saber cuáles serán las fuentes de los datos. Especialmente si los datos se adquieren de proveedores externos, es necesario identificar claramente cuál es la fuente original de los datos y qué tan confiable (veracidad) es el conjunto de datos. La segunda etapa del ciclo de vida de Big Data es muy importante, porque si los datos de entrada no son confiables, los datos de salida tampoco serán confiables.\n\n3. **Adquisición de datos y filtrado**\n\n    La Fase de Adquisición y Filtrado de Datos se basa en la etapa anterior del ciclo de vida de Big Data. En esta etapa, los datos se recopilan de diferentes fuentes, tanto dentro de la empresa como fuera de ella. Después de la adquisición, se realiza un primer paso de filtrado para filtrar los datos corruptos. Además, los datos que no son necesarios para el análisis serán filtrados también.\n\n4. **Extracción de datos**\n\n    Algunos de los datos identificados en las dos etapas anteriores pueden ser incompatibles con la herramienta Big Data que realizará el análisis real. Para tratar este problema, la etapa de extracción de datos está dedicada a extraer diferentes formatos de datos de conjuntos de datos y transformarlos en un formato que la herramienta Big Data puede procesar y analizar. La complejidad de la transformación y el grado en que es necesario transformar los datos depende en gran medida de la herramienta de Big Data que se ha seleccionado.\n\n5. **Validación y purificación de datos**\n\n    Los datos que no son válidos generan resultados no válidos. Para garantizar que solo se analicen los datos apropiados, se requiere la etapa de Validación y limpieza de datos. Durante esta etapa, los datos se validan contra un conjunto de condiciones y reglas predeterminadas para garantizar que los datos no estén corruptos. Un ejemplo de una regla de validación sería excluir a todas las personas mayores de 100 años, ya que es muy poco probable que los datos sobre estas personas sean correctos debido a limitaciones físicas.\n\n6. **Agregación y representación de datos**\n\n    Los datos pueden distribuirse en múltiples conjuntos de datos, lo que requiere que el conjunto de datos se una para realizar el análisis real. Para garantizar que solo se analicen los datos correctos en la siguiente etapa, puede ser necesario integrar múltiples conjuntos de datos. La etapa de Agregación y Representación de Datos está dedicada a integrar conjuntos de datos múltiples para llegar a una vista unificada. Además, la agregación de datos acelerará en gran medida el proceso de análisis de la herramienta Big Data, ya que no se requerirá que la herramienta junte diferentes tablas de diferentes conjuntos de datos, acelerando enormemente el proceso.\n\n7. **Análisis de datos**\n\n    La etapa Análisis de datos está dedicada a llevar a cabo la tarea de análisis real. Ejecuta el código o algoritmo que realiza los cálculos que conducirán al resultado real. El análisis de datos puede ser simple o realmente complejo, según el tipo de análisis requerido. En esta etapa, se generará el \"valor real\" del proyecto Big Data. Si todas las etapas anteriores se han ejecutado cuidadosamente, los resultados serán objetivos y correctos.\n\n8. **Visualización de datos**\n\n    La capacidad de analizar cantidades masivas de datos y encontrar información útil es una cosa, comunicar los resultados de una manera que todos puedan entender es algo completamente diferente. La etapa de visualización de datos está dedicada al uso de técnicas y herramientas de visualización de datos para comunicar gráficamente los resultados del análisis para una interpretación efectiva por parte de los usuarios. Con frecuencia, esto requiere trazar puntos de datos en cuadros, gráficos o mapas de calor.\n\n9.  **Utilización de los resultados del análisis**\n\n    Después de que se haya realizado el análisis de datos y se haya presentado el resultado, el paso final del ciclo de vida de Big Data es utilizar los resultados en la práctica. Los resultados del análisis están dedicados a determinar cómo y dónde pueden utilizarse los datos procesados para aprovechar el resultado del proyecto Big Data.\n\n---\n\n## Algunas ventajas de Big Data y de la analítica de datos\n\n* Mejora de la toma de decisiones: Con Big Data se pueden analizar datos pasados para hacer predicciones sobre el futuro. Por lo tanto, las empresas no solo pueden tomar mejores decisiones para su día a día, sino también prepararse para el futuro. Esto les da una ventaja competitiva y proporciona un marco más ágil para la toma de decisiones y el manejo de riesgos.\n\n* Reducción de costes: Big Data proporciona la inteligencia empresarial necesaria para reducir costes y mejorar la eficiencia de las operaciones. El análisis de Big Data puede proporcionar información sobre el impacto de diferentes variables en el proceso de producción, ayudando así a las industrias a tomar mejores decisiones.\n\n* Nuevos productos y servicios: Analizando los datos pasados sobre lanzamientos de productos y cruzando esos datos con datos de opiniones de clientes es posible mejorar los nuevos productos que se pretenden lanzar en el futuro. Además de esto, el análisis de mercado en tiempo real permite a las empresas comprender los cambios en la demanda y en el comportamiento de los consumidores lo que ayuda a una comercialización orientada al cliente. Una mayor demanda de servicios personalizados también puede potenciarse mediante el análisis de las necesidades del consumidor, las preferencias y los comportamientos de compra.\n\n* Feedback en tiempo real: Incluso en los momentos en los que es necesario tomar una decisión inmediata, Big Data es un arma muy poderosa puesto que permite recibir y procesar los datos a tiempo real y contar con la información necesaria rápidamente. Big Data es por encima de todo una tecnología ágil y veloz que permite por ejemplo obtener información a tiempo real del lanzamiento de un producto o el resultado de una estrategia.\n\n* Conocimiento del mercado: El conocimiento del mercado en el que se opera puede ayudar no solo a la toma de decisiones, sino también a la localización de posibles oportunidades mediante el tratamiento de estos datos. También puede ayudar a predecir posibles escenarios e incluso a conocer mejor a a los consumidores, mediante un análisis segmentado.\n\n---\n\n## Casos de uso de Big Data\n\nBig Data puede ayudar a abordar una serie de actividades empresariales, a continuación se muestran algunas de ellas:\n\n#### Desarrollo de productos\nEmpresas como Netflix y P\u0026G usan Big Data para prever la demanda de los clientes. Construyen modelos predictivos para nuevos productos y servicios clasificando atributos clave de productos anteriores y actuales y modelando la relación entre dichos atributos y el éxito comercial de las ofertas. Además, P\u0026G utiliza los datos y la analítica de grupos de interés, redes sociales, mercados de prueba y avances de salida en tiendas para planificar, producir y lanzar nuevos productos.\n\n#### Mantenimiento predictivo\nLos factores capaces de predecir fallos mecánicos pueden estar profundamente ocultos entre datos estructurados (año del equipo, marca o modelo de una máquina) o entre datos no estructurados que cubren millones de entradas de registros, datos de sensores, mensajes de error y temperaturas de motor. Al analizar estos indicadores de problemas potenciales antes de que estos se produzcan, las organizaciones pueden implantar el mantenimiento de una forma más rentable y optimizar el tiempo de servicio de componentes y equipos.\n\n#### Experiencia del cliente\nDisponer de una vista clara de la experiencia del cliente es más posible que nunca. Big Data permite recopilar datos de redes sociales, visitas a páginas web, registros de llamadas y otras fuentes de datos para mejorar la experiencia de interacción, así como maximizar el valor ofrecido. Se formulan ofertas personalizadas, reducen las tasas de abandono de los clientes y gestionan las incidencias de manera proactiva.\n\n#### Fraude y conformidad\nBig Data ayuda a identificar patrones en los datos que pueden ser indicativos de fraude, al tiempo que concentra grandes volúmenes de información para agilizar la generación de informes normativos.\n\n#### Aprendizaje automático (Machine Learning)\nEl aprendizaje automático es actualmente un tema de gran popularidad. Los datos (concretamente Big Data) son uno de los motivos de que así sea. Ahora, en lugar de programarse, las máquinas pueden aprender. Esto es posible gracias a la disponibilidad de Big Data para crear modelos de aprendizaje automático.\n\n#### Eficiencia operativa\nBig Data permite analizar y evaluar la producción, la opinión de los clientes, las devoluciones y otros factores para reducir las situaciones de falta de stock y anticipar la demanda futura. Big Data también puede utilizarse para mejorar la toma de decisiones en función de la demanda de mercado en cada momento.\n\n#### Impulso de la innovación\nBig Data puede ayudar a innovar mediante el estudio de las interdependencias entre seres humanos, instituciones, entidades y procesos, y, posteriormente, mediante la determinación de nuevas formas de usar dicha información. Utilizar las perspectivas que ofrecen los datos puede mejorar las decisiones financieras y consideraciones de planificación. \n\n---\n\n## Desafíos de Big Data\n\nSi bien es cierto que Big Data promete mucho, también se enfrenta a desafíos.\n\nEn primer lugar, Big Data se caracteriza por su gran tamaño. Aunque se han desarrollado nuevas tecnologías para el almacenamiento de datos, el volumen de datos duplica su tamaño cada dos años aproximadamente. Las organizaciones continúan esforzándose por mantener el ritmo de crecimiento de sus datos y por encontrar formas de almacenarlos eficazmente.\n\nPero no basta con almacenar los datos. Para ser de algún valor, los datos deben poder utilizarse, y esto depende de su conservación. Disponer de datos limpios (es decir, datos relevantes que permitan un análisis significativo) requiere una gran cantidad de trabajo. Los científicos de datos dedican entre un 50 y un 80 por ciento de su tiempo a seleccionar y preparar los datos antes de que estos puedan utilizarse.\n\nPor último, la tecnología de Big Data cambia a un ritmo rápido. Hace unos años, Apache Hadoop era la tecnología más conocida y utilizada para gestionar operaciones de Big Data. Más tarde, en 2014, entraría en juego Apache Spark. Hoy en día, el enfoque óptimo parece ser una combinación de ambos frameworks. Mantenerse al día en cuanto a tecnología de Big Data supone un desafío constante.\n\n\n",
      "user": "anonymous",
      "dateUpdated": "Jul 6, 2018 9:18:18 PM",
      "config": {
        "tableHide": false,
        "editorSetting": {
          "language": "markdown",
          "editOnDblClick": true
        },
        "colWidth": 12.0,
        "editorMode": "ace/mode/markdown",
        "editorHide": true,
        "results": {},
        "enabled": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "results": {
        "code": "SUCCESS",
        "msg": [
          {
            "type": "HTML",
            "data": "\u003ch1\u003e¿Qué es Big Data?\u003c/h1\u003e\n\u003cp\u003eSe han creado diferentes definiciones de Big Data, una de las más antiguas y que aún es considerada como la definición de referencia es la de \u003ca href\u003d\"https://www.gartner.com/it-glossary/big-data\"\u003eGartner(2001)\u003c/a\u003e:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e\u0026ldquo;Big Data son activos de información de gran volumen, alta velocidad y gran variedad, que demandan formas rentables e innovadoras de procesamiento, lo que permiten un mejor conocimiento, toma de decisiones y automatización de procesos\u0026rdquo;.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDicho de otro modo, Big Data está formado por conjuntos de datos de mayor tamaño y más complejos, especialmente procedentes de nuevas fuentes de datos. Estos conjuntos de datos son tan voluminosos que el software de procesamiento de datos convencional sencillamente no puede gestionarlos. Sin embargo, estos volúmenes masivos de datos pueden utilizarse para abordar problemas que antes no hubiera sido posible solucionar. Big Data no son solo datos, sino que se ha convertido en un tema completo, que involucra diversas herramientas, técnicas y frameworks.\u003c/p\u003e\n\u003chr /\u003e\n\u003ch2\u003eLas V\u0027s de Big Data\u003c/h2\u003e\n\u003cp align\u003d\"center\"\u003e\n  \u003cimg width\u003d\"460\" height\u003d\"300\" src\u003d\"https://1.bp.blogspot.com/-4PXnx5bSWO8/WH2-DfIpFZI/AAAAAAAAAg4/efnThIh6esMYtjYxwoktHFNmRrDiX5MqQCLcB/s640/7Vs_of_Big_Data.PNG\"\u003e\n\u003c/p\u003e\n\u003cp\u003eCon la definición dada por Gartner se definieron 3 características claves de Big Data, las cuales se denominaron las 3 V\u0027s de Big Data.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVolumen\u003c/strong\u003e: Esta es la característica principal que define a Big Data como \u0026ldquo;Big\u0026rdquo;. Todos los días se procesan grandes volúmenes de datos los cuales puede poseer un valor desconocido, como publicaciones de usuarios en una red social, registros de clics en una página web o aplicación para móviles o dispositivos con diferentes sensores.  Con el crecimiento de los datos que se están generando y que se deben almacenar, encontramos que el almacenamiento en Gigabytes en realidad no es suficiente. Debido a esta razón, en el mundo de hoy se analizan desde decenas de Terabytes hasta en cientos de petabytes, Exabytes, Zettabytes y Yottabytes.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVelocidad\u003c/strong\u003e: Se refiere a qué tan rápido se acceden y procesan los datos. Tradicionalmente se programaba que los datos fueran analizados y actualizados cada cierto periodo de tiempo, hoy en día, las tendencia se basa en el análisis de datos en tiempo real, por lo que las operaciones de datos en intervalos grandes no son en absoluto útiles.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVariedad\u003c/strong\u003e: La variedad hace referencia a los diversos tipos de datos disponibles. Los tipos de datos convencionales eran estructurados y podían organizarse fácilmente en una base de datos relacional. La tendencia se dirige al análisis de datos que se presentan en como datos no estructurados. Los tipos de datos no estructurados y semiestructurados, como el texto, audio o vídeo, requieren de un pre procesamiento adicional para poder obtener significado.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eA medida que pasaron los años se determinó que los anteriores 3 aspectos no son suficientes para describir Big Data en su totalidad, es por esto que en los últimos años se han identificado otras características (que también comienzan con la letra V). Partiendo de las originales \u003ca href\u003d\"https://blogs.gartner.com/doug-laney/files/2012/01/ad949-3D-Data-Management-Controlling-Data-Volume-Velocity-and-Variety.pdf\"\u003e3 V\u0027s\u003c/a\u003e se ha llegado a hablar de \u003ca href\u003d\"http://www.ibmbigdatahub.com/infographic/four-vs-big-data\"\u003e4 V\u0027s\u003c/a\u003e, \u003ca href\u003d\"https://www.wired.com/insights/2013/05/the-missing-vs-in-big-data-viability-and-value/\"\u003e5 V\u0027s\u003c/a\u003e, \u003ca href\u003d\"https://insidebigdata.com/2013/09/12/beyond-volume-variety-velocity-issue-big-data-veracity/\"\u003e6 V\u0027s\u003c/a\u003e, \u003ca href\u003d\"https://datafloq.com/read/3vs-sufficient-describe-big-data/166\"\u003e7 V\u0027s\u003c/a\u003e, \u003ca href\u003d\"https://mapr.com/blog/top-10-big-data-challenges-serious-look-10-big-data-vs/\"\u003e10 V\u0027s\u003c/a\u003e e incluso se han llegado a describir \u003ca href\u003d\"https://www.elderresearch.com/blog/42-v-of-big-data\"\u003e42 V\u0027s\u003c/a\u003e, a continuación se describen algunas de las V\u0027s adicionales mayormente aceptadas:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVeracidad\u003c/strong\u003e: Tener una gran cantidad de datos de gran volumen entrando a alta velocidad no tiene valor si esos datos son incorrectos. Los datos incorrectos pueden causar muchos problemas tanto para las organizaciones como para los consumidores. Por lo tanto, las organizaciones deben garantizar que los datos sean correctos y que los análisis realizados sobre los datos sean confiables. Especialmente en la toma de decisiones automatizada, donde ya no interviene ningún ser humano, debe asegurarse de que tanto los datos como los análisis sean acertados.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVariabilidad\u003c/strong\u003e: La variabilidad se centra principalmente en comprender e interpretar correctamente los significados de los datos brutos que dependen del contexto. Esto se requiere principalmente cuando se trabaja en procesamiento del lenguaje natural. Por ejemplo, Hay algunas palabras que pueden tener múltiples significados y el significado exacto depende del contexto en que se utiliza, es importante que el significado exacto se interprete correctamente para realizar un análisis adecuado.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVisualización\u003c/strong\u003e: se refiere a cómo se presentan los datos para la toma de decisiones, es hacer que toda esa gran cantidad de datos comprensibles de una manera que sea fácil de entender y leer. Con los análisis y visualizaciones correctos, los datos brutos pueden utilizarse, de lo contrario, los datos en bruto permanecen esencialmente inútiles. Las visualizaciones, por supuesto, no significan gráficos ordinarios o gráficos circulares. Significan gráficos complejos que pueden incluir muchas variables de datos mientras siguen siendo comprensibles y legibles.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eValor\u003c/strong\u003e: Los datos poseen un valor intrínseco. Sin embargo, no tienen ninguna utilidad hasta que dicho valor se descubre. Hoy en día, gran parte del valor que ofrecen las grandes compañías tecnológicas procede de sus datos, que analizan constantemente para generar una mayor eficiencia y desarrollar nuevos productos. Identificar el valor de los datos se trata de todo un proceso de descubrimiento que requiere que los analistas, usuarios empresariales y ejecutivos se planteen las preguntas correctas, identifiquen patrones, tomen decisiones informadas y predigan comportamientos.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003ch2\u003eLa historia de Big Data\u003c/h2\u003e\n\u003cp\u003eSi bien el concepto \u0026ldquo;Big Data\u0026rdquo; en sí mismo es relativamente nuevo, los orígenes de los grandes conjuntos de datos se remontan a las décadas de 1960 y 1970, donde se sitúan los origines de este universo con los primeros centros de datos y el desarrollo de las bases de datos relacionales.\u003c/p\u003e\n\u003cp\u003eAlrededor de 2005, la gente empezó a darse cuenta de la cantidad de datos que generaban los usuarios a través de Facebook, YouTube y otros servicios online. Ese mismo año, se desarrollaría Hadoop, un framework de código abierto creado específicamente para almacenar y analizar grandes conjuntos de datos. En esta época, también empezaría a adquirir popularidad NoSQL.\u003c/p\u003e\n\u003cp\u003eEl desarrollo de Framewoks de código abierto tales como Hadoop y más recientemente Spark, sería esencial para el crecimiento de Big Data, pues estos hicieron que Big Data resultase más fácil de usar y más barato de almacenar. En los años siguientes, el volumen de Big Data se ha disparado. Los usuarios continúan generando enormes cantidades de datos, pero ahora los humanos no son los únicos que lo hacen.\u003c/p\u003e\n\u003cp\u003eCon la llegada del Internet de las cosas (IoT), hay un mayor número de objetos y dispositivos conectados a Internet que generan datos sobre patrones de uso de los clientes y rendimiento de los productos.\u003c/p\u003e\n\u003cp\u003eAunque Big Data ha llegado lejos, su utilidad no ha hecho más que empezar. El Cloud Computing ha ampliado aún más las posibilidades de Big Data. La nube ofrece una escalabilidad realmente elástica, donde los desarrolladores pueden simplemente crear clústeres remotos y ajustarlos a sus necesidades.\u003c/p\u003e\n\u003chr /\u003e\n\u003ch2\u003eCiclo de vida de Big Data\u003c/h2\u003e\n\u003col\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eEvaluación de caso comercial\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEl comienzo del ciclo de vida de Big Data comienza con una evaluación sólida del caso comercial. Antes de que se pueda iniciar cualquier proyecto de Big Data, debe quedar claro cuáles deberían ser los objetivos comerciales y los resultados del análisis de datos. Se debe comenzar con el fin en mente y definir claramente los objetivos y los resultados deseados del proyecto. Se podrían realizar muchas formas diferentes de análisis de datos, pero ¿cuál es exactamente la razón para invertir tiempo y esfuerzo en el análisis de datos? Al igual que con cualquier buen caso comercial, la propuesta debe estar respaldada por datos financieros.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eIdentificación de datos\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLa etapa de identificación de datos determina el origen de los datos. Antes de analizar los datos, es importante saber cuáles serán las fuentes de los datos. Especialmente si los datos se adquieren de proveedores externos, es necesario identificar claramente cuál es la fuente original de los datos y qué tan confiable (veracidad) es el conjunto de datos. La segunda etapa del ciclo de vida de Big Data es muy importante, porque si los datos de entrada no son confiables, los datos de salida tampoco serán confiables.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eAdquisición de datos y filtrado\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLa Fase de Adquisición y Filtrado de Datos se basa en la etapa anterior del ciclo de vida de Big Data. En esta etapa, los datos se recopilan de diferentes fuentes, tanto dentro de la empresa como fuera de ella. Después de la adquisición, se realiza un primer paso de filtrado para filtrar los datos corruptos. Además, los datos que no son necesarios para el análisis serán filtrados también.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eExtracción de datos\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAlgunos de los datos identificados en las dos etapas anteriores pueden ser incompatibles con la herramienta Big Data que realizará el análisis real. Para tratar este problema, la etapa de extracción de datos está dedicada a extraer diferentes formatos de datos de conjuntos de datos y transformarlos en un formato que la herramienta Big Data puede procesar y analizar. La complejidad de la transformación y el grado en que es necesario transformar los datos depende en gran medida de la herramienta de Big Data que se ha seleccionado.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eValidación y purificación de datos\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLos datos que no son válidos generan resultados no válidos. Para garantizar que solo se analicen los datos apropiados, se requiere la etapa de Validación y limpieza de datos. Durante esta etapa, los datos se validan contra un conjunto de condiciones y reglas predeterminadas para garantizar que los datos no estén corruptos. Un ejemplo de una regla de validación sería excluir a todas las personas mayores de 100 años, ya que es muy poco probable que los datos sobre estas personas sean correctos debido a limitaciones físicas.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eAgregación y representación de datos\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLos datos pueden distribuirse en múltiples conjuntos de datos, lo que requiere que el conjunto de datos se una para realizar el análisis real. Para garantizar que solo se analicen los datos correctos en la siguiente etapa, puede ser necesario integrar múltiples conjuntos de datos. La etapa de Agregación y Representación de Datos está dedicada a integrar conjuntos de datos múltiples para llegar a una vista unificada. Además, la agregación de datos acelerará en gran medida el proceso de análisis de la herramienta Big Data, ya que no se requerirá que la herramienta junte diferentes tablas de diferentes conjuntos de datos, acelerando enormemente el proceso.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eAnálisis de datos\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLa etapa Análisis de datos está dedicada a llevar a cabo la tarea de análisis real. Ejecuta el código o algoritmo que realiza los cálculos que conducirán al resultado real. El análisis de datos puede ser simple o realmente complejo, según el tipo de análisis requerido. En esta etapa, se generará el \u0026ldquo;valor real\u0026rdquo; del proyecto Big Data. Si todas las etapas anteriores se han ejecutado cuidadosamente, los resultados serán objetivos y correctos.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eVisualización de datos\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLa capacidad de analizar cantidades masivas de datos y encontrar información útil es una cosa, comunicar los resultados de una manera que todos puedan entender es algo completamente diferente. La etapa de visualización de datos está dedicada al uso de técnicas y herramientas de visualización de datos para comunicar gráficamente los resultados del análisis para una interpretación efectiva por parte de los usuarios. Con frecuencia, esto requiere trazar puntos de datos en cuadros, gráficos o mapas de calor.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eUtilización de los resultados del análisis\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDespués de que se haya realizado el análisis de datos y se haya presentado el resultado, el paso final del ciclo de vida de Big Data es utilizar los resultados en la práctica. Los resultados del análisis están dedicados a determinar cómo y dónde pueden utilizarse los datos procesados para aprovechar el resultado del proyecto Big Data.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003chr /\u003e\n\u003ch2\u003eAlgunas ventajas de Big Data y de la analítica de datos\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eMejora de la toma de decisiones: Con Big Data se pueden analizar datos pasados para hacer predicciones sobre el futuro. Por lo tanto, las empresas no solo pueden tomar mejores decisiones para su día a día, sino también prepararse para el futuro. Esto les da una ventaja competitiva y proporciona un marco más ágil para la toma de decisiones y el manejo de riesgos.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eReducción de costes: Big Data proporciona la inteligencia empresarial necesaria para reducir costes y mejorar la eficiencia de las operaciones. El análisis de Big Data puede proporcionar información sobre el impacto de diferentes variables en el proceso de producción, ayudando así a las industrias a tomar mejores decisiones.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eNuevos productos y servicios: Analizando los datos pasados sobre lanzamientos de productos y cruzando esos datos con datos de opiniones de clientes es posible mejorar los nuevos productos que se pretenden lanzar en el futuro. Además de esto, el análisis de mercado en tiempo real permite a las empresas comprender los cambios en la demanda y en el comportamiento de los consumidores lo que ayuda a una comercialización orientada al cliente. Una mayor demanda de servicios personalizados también puede potenciarse mediante el análisis de las necesidades del consumidor, las preferencias y los comportamientos de compra.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eFeedback en tiempo real: Incluso en los momentos en los que es necesario tomar una decisión inmediata, Big Data es un arma muy poderosa puesto que permite recibir y procesar los datos a tiempo real y contar con la información necesaria rápidamente. Big Data es por encima de todo una tecnología ágil y veloz que permite por ejemplo obtener información a tiempo real del lanzamiento de un producto o el resultado de una estrategia.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eConocimiento del mercado: El conocimiento del mercado en el que se opera puede ayudar no solo a la toma de decisiones, sino también a la localización de posibles oportunidades mediante el tratamiento de estos datos. También puede ayudar a predecir posibles escenarios e incluso a conocer mejor a a los consumidores, mediante un análisis segmentado.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003ch2\u003eCasos de uso de Big Data\u003c/h2\u003e\n\u003cp\u003eBig Data puede ayudar a abordar una serie de actividades empresariales, a continuación se muestran algunas de ellas:\u003c/p\u003e\n\u003ch4\u003eDesarrollo de productos\u003c/h4\u003e\n\u003cp\u003eEmpresas como Netflix y P\u0026amp;G usan Big Data para prever la demanda de los clientes. Construyen modelos predictivos para nuevos productos y servicios clasificando atributos clave de productos anteriores y actuales y modelando la relación entre dichos atributos y el éxito comercial de las ofertas. Además, P\u0026amp;G utiliza los datos y la analítica de grupos de interés, redes sociales, mercados de prueba y avances de salida en tiendas para planificar, producir y lanzar nuevos productos.\u003c/p\u003e\n\u003ch4\u003eMantenimiento predictivo\u003c/h4\u003e\n\u003cp\u003eLos factores capaces de predecir fallos mecánicos pueden estar profundamente ocultos entre datos estructurados (año del equipo, marca o modelo de una máquina) o entre datos no estructurados que cubren millones de entradas de registros, datos de sensores, mensajes de error y temperaturas de motor. Al analizar estos indicadores de problemas potenciales antes de que estos se produzcan, las organizaciones pueden implantar el mantenimiento de una forma más rentable y optimizar el tiempo de servicio de componentes y equipos.\u003c/p\u003e\n\u003ch4\u003eExperiencia del cliente\u003c/h4\u003e\n\u003cp\u003eDisponer de una vista clara de la experiencia del cliente es más posible que nunca. Big Data permite recopilar datos de redes sociales, visitas a páginas web, registros de llamadas y otras fuentes de datos para mejorar la experiencia de interacción, así como maximizar el valor ofrecido. Se formulan ofertas personalizadas, reducen las tasas de abandono de los clientes y gestionan las incidencias de manera proactiva.\u003c/p\u003e\n\u003ch4\u003eFraude y conformidad\u003c/h4\u003e\n\u003cp\u003eBig Data ayuda a identificar patrones en los datos que pueden ser indicativos de fraude, al tiempo que concentra grandes volúmenes de información para agilizar la generación de informes normativos.\u003c/p\u003e\n\u003ch4\u003eAprendizaje automático (Machine Learning)\u003c/h4\u003e\n\u003cp\u003eEl aprendizaje automático es actualmente un tema de gran popularidad. Los datos (concretamente Big Data) son uno de los motivos de que así sea. Ahora, en lugar de programarse, las máquinas pueden aprender. Esto es posible gracias a la disponibilidad de Big Data para crear modelos de aprendizaje automático.\u003c/p\u003e\n\u003ch4\u003eEficiencia operativa\u003c/h4\u003e\n\u003cp\u003eBig Data permite analizar y evaluar la producción, la opinión de los clientes, las devoluciones y otros factores para reducir las situaciones de falta de stock y anticipar la demanda futura. Big Data también puede utilizarse para mejorar la toma de decisiones en función de la demanda de mercado en cada momento.\u003c/p\u003e\n\u003ch4\u003eImpulso de la innovación\u003c/h4\u003e\n\u003cp\u003eBig Data puede ayudar a innovar mediante el estudio de las interdependencias entre seres humanos, instituciones, entidades y procesos, y, posteriormente, mediante la determinación de nuevas formas de usar dicha información. Utilizar las perspectivas que ofrecen los datos puede mejorar las decisiones financieras y consideraciones de planificación.\u003c/p\u003e\n\u003chr /\u003e\n\u003ch2\u003eDesafíos de Big Data\u003c/h2\u003e\n\u003cp\u003eSi bien es cierto que Big Data promete mucho, también se enfrenta a desafíos.\u003c/p\u003e\n\u003cp\u003eEn primer lugar, Big Data se caracteriza por su gran tamaño. Aunque se han desarrollado nuevas tecnologías para el almacenamiento de datos, el volumen de datos duplica su tamaño cada dos años aproximadamente. Las organizaciones continúan esforzándose por mantener el ritmo de crecimiento de sus datos y por encontrar formas de almacenarlos eficazmente.\u003c/p\u003e\n\u003cp\u003ePero no basta con almacenar los datos. Para ser de algún valor, los datos deben poder utilizarse, y esto depende de su conservación. Disponer de datos limpios (es decir, datos relevantes que permitan un análisis significativo) requiere una gran cantidad de trabajo. Los científicos de datos dedican entre un 50 y un 80 por ciento de su tiempo a seleccionar y preparar los datos antes de que estos puedan utilizarse.\u003c/p\u003e\n\u003cp\u003ePor último, la tecnología de Big Data cambia a un ritmo rápido. Hace unos años, Apache Hadoop era la tecnología más conocida y utilizada para gestionar operaciones de Big Data. Más tarde, en 2014, entraría en juego Apache Spark. Hoy en día, el enfoque óptimo parece ser una combinación de ambos frameworks. Mantenerse al día en cuanto a tecnología de Big Data supone un desafío constante.\u003c/p\u003e\n"
          }
        ]
      },
      "apps": [],
      "jobName": "paragraph_1530217032261_461755327",
      "id": "20180626-180847_967833253",
      "dateCreated": "Jun 28, 2018 8:17:12 PM",
      "dateStarted": "Jul 6, 2018 9:18:18 PM",
      "dateFinished": "Jul 6, 2018 9:18:18 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "text": "",
      "dateUpdated": "Jun 28, 2018 8:17:12 PM",
      "config": {
        "colWidth": 12.0,
        "editorMode": "ace/mode/markdown",
        "results": {},
        "enabled": true,
        "editorSetting": {
          "editOnDblClick": true,
          "language": "markdown"
        }
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "apps": [],
      "jobName": "paragraph_1530217032262_462909573",
      "id": "20180626-210142_1608139983",
      "dateCreated": "Jun 28, 2018 8:17:12 PM",
      "status": "READY",
      "errorMessage": "",
      "progressUpdateIntervalMs": 500
    }
  ],
  "name": "Introducción",
  "id": "2DJSYDJNY",
  "angularObjects": {
    "2CHS8UYQQ:shared_process": [],
    "2C8A4SZ9T_livy2:shared_process": [],
    "2CK8A9MEG:shared_process": [],
    "2C4U48MY3_spark2:shared_process": [],
    "2CKAY1A8Y:shared_process": [],
    "2CKEKWY8Z:shared_process": []
  },
  "config": {},
  "info": {}
}