{
  "paragraphs": [
    {
      "text": "##El ecosistema de Big Data es demasiado grande\n\nTal como está hoy, el ecosistema de big data es demasiado grande, complejo y redundante. Es un mercado confuso para las empresas que han aceptado la idea del big data, pero luego tropiezan cuando se enfrentan a demasiadas decisiones, en demasiadas capas en la pila de tecnología.\n\nEl ecosistema de big data tiene demasiados estándares. Tiene demasiados motores. Tiene demasiados proveedores. El ecosistema, tal como existe ahora, aleja a los clientes, inhibe la financiación de los proyectos de los clientes y desalienta el apoyo político para ellos dentro de las organizaciones.\n\n* BI / Analytics: en la parte superior de la pila, hay opciones aparentemente interminables. Ya sea que Enterprise BI sea incondicional, retadores de BI 2.0 o jugadores de análisis de big data, la cantidad de proveedores y su posicionamiento similar lo hace realmente difícil para los clientes. Es difícil distinguir entre soluciones, incluso significativamente diferentes, cuando los mensajes y las imágenes son muy similares.\n\n* Distribuciones: baje en la pila y hay mucho para elegir en la capa de distribución de Hadoop y Spark. Ya es bastante difícil que los \"tres grandes\" (Cloudera, Hortonworks y MapR) ofrezcan sus propias distribuciones de Hadoop, con Spark integrado. Pero agregue otras ofertas de IBM, y los jugadores de la nube, grandes y pequeños, y las cosas se vuelven un poco locas. Lo que es difícil para el cliente aquí es que el núcleo de estas pilas difieren en su composición y / o tienen diferentes versiones de los mismos componentes.\n\n* Motores de ejecución: y hablando de componentes, también tenemos demasiados motores de ejecución. Hadoop cambió de MapReduce a Tez. Entonces Spark se estableció. Y ahora, parece, Apache Flink está esperando en las alas. En el lado de la transmisión, Apache Storm, NiFi, Spark y Kafka, en varias combinaciones, compiten por la atención. Y mientras que el aprendizaje automático de Big Data comenzó con Apache Mahout, parece estar cambiando a Spark MLlib y en otros lugares. Luego están las permutaciones. Por ejemplo, Spark puede ejecutarse en YARN, el administrador de recursos de Hadoop 2.0. Pero no tiene por qué. Y cuando utiliza la oferta Spark basada en la nube de Databricks (la compañía fundada por los creadores de Spark), no es así.\n\n* SQL, conjuntos de datos y flujos: Y mientras SQL se abrió paso en la conversación de Big Data para hacer que todo sea \"más fácil\" de usar por los conjuntos de habilidades de aprovechamiento existentes, también hay demasiados SQL en las soluciones de big data. ¿Deberías usar Hive o Spark SQL? Si usa Hive, ¿debería usarlo en MapReduce o Tez? Además, no te olvides de Impala. O HAWQ, Apache Drill, Presto y todos los puentes SQL-on-Hadoop de los grandes proveedores de bases de datos, incluidos Teradata, HP, Microsoft, Oracle e IBM. Ni siquiera profundicemos en el hecho de que el uso de SQL puede ser una antítesis de Hadoop y sus beneficios únicos. Sin embargo, otra capa de confusión. Incluso dentro de una pila bien definida con un pequeño número de componentes, la fragmentación puede ser desenfrenada. En el mundo de Spark, puede usar conjuntos de datos distribuidos (RDD) resistentes, marcos de datos o conjuntos de datos. Y los desarrolladores de Spark pueden usar las nuevas Spark Structured Streams para datos en movimiento. Pero, ¿qué pasa con Kafka Streams? Esos son brillantes y nuevos también.\n\n* Para codificar o no codificar: cuando se trata de lenguajes de programación, ¿debe codificar en R o Python? ¿Qué hay de Scala? Y para el caso, ¿por qué no echarles un hueso a los desarrolladores de empresas y dejarles usar Java e incluso C # para escribir su código de big data? Se puede controlar aquí, pero a costa de autoservicio y permitir que más personas dentro de su organización.\n\n### Mejores prácticas para avanzar en el ecosistema de Big Data\n\nSí, las cosas están un poco desordenadas, pero están lejos de ser inútiles. Podemos solucionar este problema y podemos dejar que se destaque el importante valor que el ecosistema de big data ha creado. En Hadoop Summit San José, presenté algunas ideas sobre cómo nosotros, como proveedores, analistas, capitalistas de riesgo y todos los demás que conforman este ecosistema de grandes datos, podemos mejorar la situación. Pero más importante aún, esbocé algunos consejos y trucos para los clientes que actualmente están intentando navegar en estas aguas turbias.\n\n## Big Data Ecosystem Best Practice # 1: Comience siempre con un caso de uso\n\nNo te vengas vendido por tecnología brillante. En una reciente encuesta de Gartner, el principal desafío de big data citado por los encuestados fue \"determinar cómo obtener valor del Big Data\" (58% de los encuestados). ¿Cómo lo remedias? Comience siempre con la definición de su caso de uso, luego trabaje hacia la búsqueda de la tecnología que lo respalde.\n\n## Big Data Ecosystem Best Practice # 2: Considere el Control vs. Democratización\n\nComo se mencionó anteriormente, puede ser tentador darse a ti mismo / a tu equipo controles de nivel fino con herramientas que te permiten codificar. Pero tenga cuidado con la cantidad de control que realmente necesita: ¿se puede mejorar el mejor servicio al poner los datos en manos de más personas en la organización con herramientas de autoservicio? Busque el equilibrio correcto.\n\n## Big Data Ecosystem Best Practice # 3: Piensa preparado para el futuro\n\nYa lo hemos visto La industria se está contrayendo, expandiendo, contrayendo, expandiendo. Es por eso que es increíblemente importante que al evaluar su compra de tecnología, busque señales de que la tecnología en sí misma es \"a prueba de futuro\" o \"preparada para el futuro\" a través de una arquitectura modular y \"conectable\". Porque, si bien es posible que no desee saltar sobre el próximo nuevo proyecto brillante o estándar, querrá la opción de migrar a él, ya que es prudente hacerlo.\n\n\n\n[Datameer](https://www.datameer.com/blog/big-data-ecosystem/ \"Datameer\")\n\n\n\n##La Evolución del Ecosistema Big Data se explora en Data Summit 2018\n\nLa evolución de la informática ha cambiado drásticamente desde que se presentó por primera vez el mainframe. Gracias a la proliferación de opciones para manejar Big Data de forma más natural y eficiente que los sistemas de administración de bases de datos relacionales (RDBMS), estamos en una \"era post-relacional\".\n\nDavid Teplow, CEO de Integra Technology Consulting, presentó su sesión, \"Secuela de SQL: Hadoop y la revolución posrelacional\", el martes 22 de mayo de 2018 durante Data Summit 2018. Su sesión se zambulló profundamente en las mejores soluciones para utilizar durante este \" era.\"\n\nData Summit 2018 se llevará a cabo en el Hyatt Regency Boston, del 22 al 23 de mayo, con talleres previos a la conferencia el lunes 21 de mayo. Cognitive Computing Summit también se ubicará en el evento.\n\nTeplow explicó que Hadoop nació de dos piezas publicadas que describen el sistema de archivos de Google y MapReduce. A partir de este procesamiento masivamente paralelo (MPP) nacieron las arquitecturas.\n\nLos sistemas MPP se pueden clasificar por estructura y por característica. Las características incluyen:\n\n* Relacional\n* Valor clave\n* Columna amplia\n* Documento\n* Consistencia\n* Disponibilidad\n* Tolerancia de partición\n\n\nLos sistemas MPP relacionales son mejores para una compatibilidad total con SQL y ACID, mientras que los sistemas MPP con valor clave son los mejores para los datos que cambian rápidamente y para la alta confabulación.\n\nLos sistemas MPP de gran columna son los mejores para volúmenes de escritura extremos y los sistemas Document MPP son los mejores para sistemas de lectura lenta y lentos, dijo Teplow.\n\nSin embargo, donde hay opciones, Teplow explicó que el Teorema de CAP establece que solo puedes tener dos de las mejores características.\n\nEl Teorema CAP fue propuesto y presentado por Eric Brewer (Profesor de UC Berkeley / Co-Fundador y Científico Jefe de Inktomi) en el Simposio 2000 sobre Principios de Computación Distribuida (PODC), luego probado por Seth Gilbert y Nancy Lynch de MIT.\n\nDe acuerdo con el Teorema, solo dos de los siguientes atributos pueden estar presentes en su solución:\n\n* Consistencia: cada cliente siempre tiene la misma visión de los datos\n* Disponibilidad: todos los clientes siempre pueden leer y escribir\n* Tolerancia de partición: el sistema funciona bien en las particiones de red física\n\n\nData Summit 2019, presentado por DBTA y Big Data Quarterly, está tentativamente programado del 21 al 22 de mayo de 2019 en el Hyatt Regency Boston con talleres previos a la conferencia el 20 de mayo.\n\nMuchas presentaciones de Data Summit 2018 se han puesto a disposición para su revisión en http://www.dbta.com/DataSummit/2018/Presentations.aspx.\n\n\n\n[DBTA](http://www.dbta.com/Editorial/News-Flashes/The-Evolution-of-the-Big-Data-Ecosystem-is-Explored-at-Data-Summit-2018-125208.aspx \"dbta\")\n\n\n\n\n##Gran poder, gran responsabilidad: el 2018 Big Data \u0026 AI Landscape\n\nHa sido un año emocionante pero complejo en el mundo de los datos.\n\nAl igual que el año pasado, el ecosistema de tecnología de datos continuó \"disparando a toda máquina\". Si nada más, probablemente los datos estén aún más al frente y en el centro en 2018, tanto en conversaciones comerciales como personales. Algunas de las razones, sin embargo, han cambiado.\n\nPor un lado, las tecnologías de datos (Big Data, ciencia de datos, aprendizaje automático, inteligencia artificial) continúan avanzando, llegando a ser cada vez más eficientes y también más ampliamente adoptadas en empresas de todo el mundo. No es accidental que uno de los temas clave en el mundo corporativo en 2018 haya sido la \"transformación digital\". El término puede parecer pintoresco para algunos (\"¿no es eso lo que ha estado sucediendo durante los últimos 25 años?\"), Pero refleja que muchas de las industrias y empresas más tradicionales ahora están plenamente comprometidas en su viaje para convertirse verdaderamente en datos .\n\nPor otro lado, una sección transversal mucho más amplia del público ha tomado conciencia de las dificultades de los datos. Ya sea a través del debate público sobre los riesgos de AI, el escándalo de Cambridge Analytica, la masiva violación de datos de Equifax, discusiones de privacidad relacionadas con GDPR o informes de creciente vigilancia gubernamental en China, el mundo de los datos ha comenzado a revelar algunos matices más oscuros y espantosos. .\n\nAmbos son la otra cara del mismo fenómeno, que se viene gestando desde hace muchos años pero que ahora se exhibe a la perfección: prácticamente todo (ya sea personal o profesional) se digitaliza rápidamente, y las tecnologías de datos se vuelven más expertas que nunca en el procesamiento y análisis este escape masivo de datos, cada vez más en tiempo real. De esto puede resultar tanto magia como abuso. El debate sobre cómo combinar este gran poder con un sentido de responsabilidad necesario se ha vuelto esencial.\n\nDestaquemos algunas de las tendencias y eventos clave de 2018.\n\nInfraestructura y Analítica\n\nDesde el punto de vista de la industria, el ecosistema de datos sigue siendo tan emocionante y vibrante como siempre, con un rico tapiz de nuevas empresas innovadoras, \"ampliaciones\" maduras y muchos proveedores agresivos de tecnología pública. Lo que es más importante, muchos clientes, grandes y pequeños, están desplegando esas tecnologías en producción a gran escala y cosechando un valor innegable de sus esfuerzos.\n\nA medida que el ciclo de sustitución de las tecnologías informáticas más antiguas con productos de datos más modernos continúa, parece que el mercado de Big Data (infraestructura, análisis) está circulando a través de la mayoría de los compradores y está en transición a la mayoría tardía de la curva de adopción tradicional.\n\n\n[![](http://mattturck.com/wp-content/uploads/2018/06/adoption-cycle.jpg)]\n\nAdemás, el mundo de los datos continúa su evolución inexorable hacia la nube. En realidad, es asombroso ver qué tan rápido están creciendo los grandes proveedores de nubes públicas (AWS, Azure, Google Cloud Platform, IBM), considerando que ya cada uno genera miles de millones de dólares en ingresos cada trimestre. La tendencia plantea continuas preocupaciones sobre el bloqueo de proveedores, y esto puede abrir oportunidades para startups que ofrecen soluciones de múltiples nubes. Sin embargo, hasta la fecha, incluso las empresas que adoptan estrategias de nubes múltiples tienden a depender aún de un proveedor como su proveedor principal.\n\nA medida que siguen creciendo, los proveedores de grandes nubes compiten cada vez más entre sí ofreciendo una amplia gama de Big Data, ingeniería de datos y herramientas de aprendizaje automático a través de sus plataformas (por ejemplo, Amazon Neptune, Google AutoML, etc.), y a menudo con precios agresivos. para atraer a más desarrolladores, ya que su verdadero modelo comercial es el almacenamiento de datos. A medida que el alcance y la sofisticación de estas herramientas siguen creciendo, esto tiene un gran impacto en el panorama de la tecnología de datos, lo que hace que sea difícil para las startups competir, al menos en oportunidades horizontales amplias. Un poco más cada año, la lista de anuncios de productos en grandes conferencias anuales de vendedores en la nube (ver AWS re: Invent, por ejemplo) envía ondas de choque en la industria de inicio, ya que ponen a los vendedores en la nube en competencia directa con docenas de startups respaldadas por VC en un solo golpe. Será interesante ver cómo reaccionan los mercados públicos ante la próxima Elastic IPO, una compañía de software de código abierto que vio a Amazon lanzar a un competidor directo, Elasticsearch, hace tres años.\n\nSin embargo, quedan muchas oportunidades para startups, siempre que estén suficientemente diferenciadas. Muchos en el espacio están escalando rápidamente, y hay una serie de segmentos particularmente interesantes y de rápido crecimiento en la parte de infraestructura y análisis del ecosistema, incluidos la transmisión en tiempo real, el gobierno de datos y los tejidos / virtualización de datos. La explosión de interés en AI también ha generado grandes oportunidades (y una gran cantidad de fondos) en chips AI, bases de datos GPU, herramientas AI devops y plataformas que permiten el despliegue de ciencia de datos y aprendizaje automático en la empresa.\n\n###Machine Learning \u0026 AI\n\nCiertamente ha sido un año salvaje en el mundo de la investigación de la IA, con algo de la destreza de AlphaZero al increíble ritmo de lanzamiento de nuevos avances: nuevas formas de Redes de Adversarios Generacionales, nuevas Redes Corticales Recursivas de Vicarious, nuevas Capsule Networks de Geoff Hinton. Las conferencias de AI como NIPS han crecido para atraer a 8,000 personas y miles de documentos académicos se envían todos los días.\n\nAl mismo tiempo, la búsqueda de AGI sigue siendo esquiva, tal vez afortunadamente. Gran parte de la actual ola de emoción (y miedo) sobre AI resulta del impresionante rendimiento del aprendizaje profundo desde 2012 pero, en la comunidad de investigación de IA, hay una sensación creciente de \"¿y ahora qué?\", Como algunos cuestionan los fundamentos del aprendizaje profundo ( backpropagation) y otros buscan pasar de lo que consideran enfoques de \"fuerza bruta\" (gran cantidad de datos, mucho poder de cómputo), tal vez a favor de más enfoques basados en la neurociencia.\n\nLejos de temer a la dominación mundial de los robots, muchos en la comunidad de investigación de la IA están preocupados de que la continua exageración del campo pueda decepcionar y conducir a otro invierno nuclear de IA.\n\nSin embargo, al margen de la investigación en IA, recién estamos comenzando una ola de implementación y aplicación de aprendizaje profundo en el mundo real a través de una variedad de problemas que involucran reconocimiento de voz, clasificación de imágenes, reconocimiento de objetos y lenguaje en diferentes industrias. Si la parte de infraestructura y análisis del ecosistema está llegando a la mayoría tardía, todavía estamos en el territorio de los primeros adoptadores para las aplicaciones de IA vertical y empresarial.\n\nLa explosión del Cámbrico de startups de aprendizaje profundo que comenzó hace uno o dos años ha continuado sin cesar, a pesar de que el mercado de la IA está (posiblemente) mostrando signos de finalmente enfriarse. Las expectativas, tamaños redondos y valoraciones siguen siendo altos, pero ciertamente estamos más allá de la fase en la que las grandes compañías de Internet tomarían muy temprano las nuevas empresas de IA a precios altos solo para el talento. El aire también se está aclarando un poco y revela startups \"reales\" de IA, en comparación con otras compañías que aprovecharon el bombo. Algunas de las startups de IA que se fundaron en el período 2014-2016 están comenzando a alcanzar la escala inicial, y muchas ofrecen productos cada vez más interesantes en industrias y sectores como la salud, las finanzas, la \"industria 4.0\" y la automatización de back office. El aprendizaje profundo continuará aportando mucho valor en las aplicaciones del mundo real en los próximos años, y las startups de inteligencia artificial con enfoque vertical tienen muchas oportunidades grandes por delante.\n\nEsta explosión continua es un fenómeno global, con Canadá, Francia, Alemania, el Reino Unido e Israel siendo particularmente activos. Sin embargo, China parece estar jugando a un nivel completamente diferente en IA, con informes de agrupamiento de datos liderado por el gobierno a escala alucinante (en empresas de Internet y municipalidades), avances rápidos en áreas como el reconocimiento facial y los chips AI, y gigantescas rondas de financiación para sus startups: según CB Insights, China representó solo el 9% de la cuota global de AI, pero casi el 48% de la financiación mundial de AI en 2017, frente al 11% en 2016 (ver algunos ejemplos a continuación).\n\nEn el mismo sentido, las cuestiones de privacidad de datos (y propiedad y seguridad) están surgiendo como una gran preocupación en todo el mundo. En los primeros días de Internet, la privacidad de los datos se trataba de proteger lo que hacíamos en línea, una parte comparativamente pequeña de nuestras actividades. En consecuencia, solo una pequeña (aunque vocal y apasionada) minoría de personas realmente se preocupó. Como casi todos los aspectos de nuestra vida personal y profesional ahora están conectados a Internet a través de una gama cada vez mayor de dispositivos conectados, lo que está en juego está cambiando. Con su capacidad para detectar anomalías en conjuntos de datos masivos, predecir resultados y reconocer rostros, AI está agravando el problema de privacidad de datos.\n\nUna preocupación separada pero relacionada es que gran parte de esta información es propiedad de grandes compañías de Internet (GAFA). Algunos, como Facebook, han demostrado ser un mayordomo menos que perfecto. No obstante, estos datos les proporcionan una ventaja injusta en la carrera por producir IA cada vez más poderosa.\n\nContra estos temas, un tema emergente es pensar en la cadena de bloques como una posible lámina contra los riesgos de la IA, así como una manera para que otros, fuera de GAFA, produzcan una gran inteligencia artificial. La criptoeconomía se ve como una forma de incentivar a las personas a proporcionar sus datos personales y para que los ingenieros de aprendizaje automático construyan modelos procesando estos datos de forma anónima. Todo sigue siendo muy experimental, pero están surgiendo algunos mercados y redes tempranas\n\n###El paisaje 2018\n\nSin más preámbulos, aquí está nuestro paisaje 2018.\n\nNota bastante semántica: los términos de moda van y vienen. Menos personas hablan sobre \"Big Data\", muchas más sobre \"AI\", a menudo para describir la misma realidad. En consecuencia, hemos cambiado ligeramente el nombre de nuestro paisaje de 2018: ahora se llama el paisaje \"Big Data \u0026 AI\".\n\n###Quién entra, quién sale\n\nEn el frente de salida, el año pasado (desde nuestro paisaje de 2017) se ha visto sólido, pero no extraordinariamente fuerte.\n\nAlgunas compañías clave que aparecen en el paisaje se hicieron públicas, en particular Cloudera, MongoDB Pivotal y Zuora. Otros se están preparando para salir al momento de escribir esto, como Elastic.\n\nTambién se produjeron algunas adquisiciones notables, incluyendo en particular Mulesoft (adquirido por Salesforce post-IPO, por $ 6.5B), Flatiron Health (adquirido por Roched por $ 2.1B), Appnexus (adquirido por AT \u0026 T por $ 1.6B), Syncsort y Vision Solutions (adquiridas por por $ 1.2B por Centerbridge Partners), Moat (adquirido por Oracle por $ 850M), Integral Ad Science (adquirido por Vista Equity Partners por $ 850M), eVestment (adquirido por NASDAQ por $ 705M) y Kensho (adquirido por S \u0026 P Global por $ 550 METRO). Vale la pena señalar que, aparte de Mulesoft, todas esas empresas tienen su sede en la costa este (Nueva York, Boston y Atlanta).\n\nMuchas otras compañías también fueron adquiridas por montos menores: Gigya (SAP), Blue River Technology (Deere \u0026 Co), CoreOS (Red Hat), Guavus (Thales), Lattice Data (Apple), Socrata (Tyler Technologies) y PracticeFusion (AllScripts). )\n\nEn el frente de inversión, este fue un año de grandes rondas de financiamiento para algunas startups de Big Data e IA, particularmente en China, con una cantidad de inversiones de gran tamaño que incluyen Bytedance ($ 3B en total en 2 rondas en 2017), NIO ($ 1.6B en todo dos rondas en 2017) y SenseTime ($ 850M en dos en 2017 y 2018).\n\nLas principales rondas de compañías estadounidenses que aparecen en el paisaje incluyen Snowflake Computing ($ 263M Serie A - vea nuestro reciente chat junto a la chimenea en Data Driven NYC), Cohesity ($ 250M Serie D), Dataminr ($ 221M Serie E), Affirm ($ 200M Series E), Rubrik ($ 180M Serie D), Qualtrics ($ 180M Serie C - vea un chat anterior pero relevante en Data Driven NYC), Tanium ($ 180M serie de capital privado), ThoughtSpot ($ 145M Serie D) y Coveo (Ronda de capital privado de $ 100 millones) y C3IoT (serie F de $ 100 millones).\n\n\n\n[mattturck 2018](http://mattturck.com/bigdata2018/ \"mattturck 2018\")\n[mattturck 2017](http://mattturck.com/bigdata2017/ \"mattturck 2017\")\n\n\n[![](http://mattturck.com/wp-content/uploads/2018/06/Matt-Turck-FirstMark-Big-Data-Landscape-2018.png)](http://mattturck.com/wp-content/uploads/2018/06/Matt-Turck-FirstMark-Big-Data-Landscape-2018.png \"Big Data Landscape 2018\")\n\n\notros recursos a revisar:\n\n[1](https://link.springer.com/content/pdf/10.1007%2Fs10021-016-0075-y.pdf)\n[2](https://www.nature.com/articles/527S16a)\n[3](http://www.uazone.org/demch/worksinprogress/sne-2013-02-techreport-bdaf-draft02.pdf)\n[4](https://www.pentahoworld.com/sites/default/files/2017-11/Understanding-the-Big-Data-Technology-Ecosystem-PWorld2017_0.pdf)\n[5!](https://bigdataecosystem.knowledgent.com/big-data-ecosystem/#)\n[6](https://interset.com/2018/01/23/big-data-tech-explained-part-1/)\n[7](https://interset.com/2018/01/30/big-data-tech-part-2/)",
      "user": "anonymous",
      "dateUpdated": "Jun 28, 2018 9:19:40 PM",
      "config": {
        "colWidth": 12.0,
        "enabled": true,
        "results": {},
        "editorSetting": {
          "editOnDblClick": true,
          "language": "markdown"
        },
        "editorMode": "ace/mode/markdown",
        "editorHide": true,
        "tableHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "results": {
        "code": "SUCCESS",
        "msg": [
          {
            "type": "HTML",
            "data": "\u003ch2\u003eEl ecosistema de Big Data es demasiado grande\u003c/h2\u003e\n\u003cp\u003eTal como está hoy, el ecosistema de big data es demasiado grande, complejo y redundante. Es un mercado confuso para las empresas que han aceptado la idea del big data, pero luego tropiezan cuando se enfrentan a demasiadas decisiones, en demasiadas capas en la pila de tecnología.\u003c/p\u003e\n\u003cp\u003eEl ecosistema de big data tiene demasiados estándares. Tiene demasiados motores. Tiene demasiados proveedores. El ecosistema, tal como existe ahora, aleja a los clientes, inhibe la financiación de los proyectos de los clientes y desalienta el apoyo político para ellos dentro de las organizaciones.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eBI / Analytics: en la parte superior de la pila, hay opciones aparentemente interminables. Ya sea que Enterprise BI sea incondicional, retadores de BI 2.0 o jugadores de análisis de big data, la cantidad de proveedores y su posicionamiento similar lo hace realmente difícil para los clientes. Es difícil distinguir entre soluciones, incluso significativamente diferentes, cuando los mensajes y las imágenes son muy similares.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eDistribuciones: baje en la pila y hay mucho para elegir en la capa de distribución de Hadoop y Spark. Ya es bastante difícil que los \u0026ldquo;tres grandes\u0026rdquo; (Cloudera, Hortonworks y MapR) ofrezcan sus propias distribuciones de Hadoop, con Spark integrado. Pero agregue otras ofertas de IBM, y los jugadores de la nube, grandes y pequeños, y las cosas se vuelven un poco locas. Lo que es difícil para el cliente aquí es que el núcleo de estas pilas difieren en su composición y / o tienen diferentes versiones de los mismos componentes.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eMotores de ejecución: y hablando de componentes, también tenemos demasiados motores de ejecución. Hadoop cambió de MapReduce a Tez. Entonces Spark se estableció. Y ahora, parece, Apache Flink está esperando en las alas. En el lado de la transmisión, Apache Storm, NiFi, Spark y Kafka, en varias combinaciones, compiten por la atención. Y mientras que el aprendizaje automático de Big Data comenzó con Apache Mahout, parece estar cambiando a Spark MLlib y en otros lugares. Luego están las permutaciones. Por ejemplo, Spark puede ejecutarse en YARN, el administrador de recursos de Hadoop 2.0. Pero no tiene por qué. Y cuando utiliza la oferta Spark basada en la nube de Databricks (la compañía fundada por los creadores de Spark), no es así.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003eSQL, conjuntos de datos y flujos: Y mientras SQL se abrió paso en la conversación de Big Data para hacer que todo sea \u0026ldquo;más fácil\u0026rdquo; de usar por los conjuntos de habilidades de aprovechamiento existentes, también hay demasiados SQL en las soluciones de big data. ¿Deberías usar Hive o Spark SQL? Si usa Hive, ¿debería usarlo en MapReduce o Tez? Además, no te olvides de Impala. O HAWQ, Apache Drill, Presto y todos los puentes SQL-on-Hadoop de los grandes proveedores de bases de datos, incluidos Teradata, HP, Microsoft, Oracle e IBM. Ni siquiera profundicemos en el hecho de que el uso de SQL puede ser una antítesis de Hadoop y sus beneficios únicos. Sin embargo, otra capa de confusión. Incluso dentro de una pila bien definida con un pequeño número de componentes, la fragmentación puede ser desenfrenada. En el mundo de Spark, puede usar conjuntos de datos distribuidos (RDD) resistentes, marcos de datos o conjuntos de datos. Y los desarrolladores de Spark pueden usar las nuevas Spark Structured Streams para datos en movimiento. Pero, ¿qué pasa con Kafka Streams? Esos son brillantes y nuevos también.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003ePara codificar o no codificar: cuando se trata de lenguajes de programación, ¿debe codificar en R o Python? ¿Qué hay de Scala? Y para el caso, ¿por qué no echarles un hueso a los desarrolladores de empresas y dejarles usar Java e incluso C # para escribir su código de big data? Se puede controlar aquí, pero a costa de autoservicio y permitir que más personas dentro de su organización.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eMejores prácticas para avanzar en el ecosistema de Big Data\u003c/h3\u003e\n\u003cp\u003eSí, las cosas están un poco desordenadas, pero están lejos de ser inútiles. Podemos solucionar este problema y podemos dejar que se destaque el importante valor que el ecosistema de big data ha creado. En Hadoop Summit San José, presenté algunas ideas sobre cómo nosotros, como proveedores, analistas, capitalistas de riesgo y todos los demás que conforman este ecosistema de grandes datos, podemos mejorar la situación. Pero más importante aún, esbocé algunos consejos y trucos para los clientes que actualmente están intentando navegar en estas aguas turbias.\u003c/p\u003e\n\u003ch2\u003eBig Data Ecosystem Best Practice # 1: Comience siempre con un caso de uso\u003c/h2\u003e\n\u003cp\u003eNo te vengas vendido por tecnología brillante. En una reciente encuesta de Gartner, el principal desafío de big data citado por los encuestados fue \u0026ldquo;determinar cómo obtener valor del Big Data\u0026rdquo; (58% de los encuestados). ¿Cómo lo remedias? Comience siempre con la definición de su caso de uso, luego trabaje hacia la búsqueda de la tecnología que lo respalde.\u003c/p\u003e\n\u003ch2\u003eBig Data Ecosystem Best Practice # 2: Considere el Control vs. Democratización\u003c/h2\u003e\n\u003cp\u003eComo se mencionó anteriormente, puede ser tentador darse a ti mismo / a tu equipo controles de nivel fino con herramientas que te permiten codificar. Pero tenga cuidado con la cantidad de control que realmente necesita: ¿se puede mejorar el mejor servicio al poner los datos en manos de más personas en la organización con herramientas de autoservicio? Busque el equilibrio correcto.\u003c/p\u003e\n\u003ch2\u003eBig Data Ecosystem Best Practice # 3: Piensa preparado para el futuro\u003c/h2\u003e\n\u003cp\u003eYa lo hemos visto La industria se está contrayendo, expandiendo, contrayendo, expandiendo. Es por eso que es increíblemente importante que al evaluar su compra de tecnología, busque señales de que la tecnología en sí misma es \u0026ldquo;a prueba de futuro\u0026rdquo; o \u0026ldquo;preparada para el futuro\u0026rdquo; a través de una arquitectura modular y \u0026ldquo;conectable\u0026rdquo;. Porque, si bien es posible que no desee saltar sobre el próximo nuevo proyecto brillante o estándar, querrá la opción de migrar a él, ya que es prudente hacerlo.\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"https://www.datameer.com/blog/big-data-ecosystem/\" title\u003d\"Datameer\"\u003eDatameer\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003eLa Evolución del Ecosistema Big Data se explora en Data Summit 2018\u003c/h2\u003e\n\u003cp\u003eLa evolución de la informática ha cambiado drásticamente desde que se presentó por primera vez el mainframe. Gracias a la proliferación de opciones para manejar Big Data de forma más natural y eficiente que los sistemas de administración de bases de datos relacionales (RDBMS), estamos en una \u0026ldquo;era post-relacional\u0026rdquo;.\u003c/p\u003e\n\u003cp\u003eDavid Teplow, CEO de Integra Technology Consulting, presentó su sesión, \u0026ldquo;Secuela de SQL: Hadoop y la revolución posrelacional\u0026rdquo;, el martes 22 de mayo de 2018 durante Data Summit 2018. Su sesión se zambulló profundamente en las mejores soluciones para utilizar durante este \" era.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eData Summit 2018 se llevará a cabo en el Hyatt Regency Boston, del 22 al 23 de mayo, con talleres previos a la conferencia el lunes 21 de mayo. Cognitive Computing Summit también se ubicará en el evento.\u003c/p\u003e\n\u003cp\u003eTeplow explicó que Hadoop nació de dos piezas publicadas que describen el sistema de archivos de Google y MapReduce. A partir de este procesamiento masivamente paralelo (MPP) nacieron las arquitecturas.\u003c/p\u003e\n\u003cp\u003eLos sistemas MPP se pueden clasificar por estructura y por característica. Las características incluyen:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRelacional\u003c/li\u003e\n\u003cli\u003eValor clave\u003c/li\u003e\n\u003cli\u003eColumna amplia\u003c/li\u003e\n\u003cli\u003eDocumento\u003c/li\u003e\n\u003cli\u003eConsistencia\u003c/li\u003e\n\u003cli\u003eDisponibilidad\u003c/li\u003e\n\u003cli\u003eTolerancia de partición\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eLos sistemas MPP relacionales son mejores para una compatibilidad total con SQL y ACID, mientras que los sistemas MPP con valor clave son los mejores para los datos que cambian rápidamente y para la alta confabulación.\u003c/p\u003e\n\u003cp\u003eLos sistemas MPP de gran columna son los mejores para volúmenes de escritura extremos y los sistemas Document MPP son los mejores para sistemas de lectura lenta y lentos, dijo Teplow.\u003c/p\u003e\n\u003cp\u003eSin embargo, donde hay opciones, Teplow explicó que el Teorema de CAP establece que solo puedes tener dos de las mejores características.\u003c/p\u003e\n\u003cp\u003eEl Teorema CAP fue propuesto y presentado por Eric Brewer (Profesor de UC Berkeley / Co-Fundador y Científico Jefe de Inktomi) en el Simposio 2000 sobre Principios de Computación Distribuida (PODC), luego probado por Seth Gilbert y Nancy Lynch de MIT.\u003c/p\u003e\n\u003cp\u003eDe acuerdo con el Teorema, solo dos de los siguientes atributos pueden estar presentes en su solución:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eConsistencia: cada cliente siempre tiene la misma visión de los datos\u003c/li\u003e\n\u003cli\u003eDisponibilidad: todos los clientes siempre pueden leer y escribir\u003c/li\u003e\n\u003cli\u003eTolerancia de partición: el sistema funciona bien en las particiones de red física\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eData Summit 2019, presentado por DBTA y Big Data Quarterly, está tentativamente programado del 21 al 22 de mayo de 2019 en el Hyatt Regency Boston con talleres previos a la conferencia el 20 de mayo.\u003c/p\u003e\n\u003cp\u003eMuchas presentaciones de Data Summit 2018 se han puesto a disposición para su revisión en http://www.dbta.com/DataSummit/2018/Presentations.aspx.\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.dbta.com/Editorial/News-Flashes/The-Evolution-of-the-Big-Data-Ecosystem-is-Explored-at-Data-Summit-2018-125208.aspx\" title\u003d\"dbta\"\u003eDBTA\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003eGran poder, gran responsabilidad: el 2018 Big Data \u0026amp; AI Landscape\u003c/h2\u003e\n\u003cp\u003eHa sido un año emocionante pero complejo en el mundo de los datos.\u003c/p\u003e\n\u003cp\u003eAl igual que el año pasado, el ecosistema de tecnología de datos continuó \u0026ldquo;disparando a toda máquina\u0026rdquo;. Si nada más, probablemente los datos estén aún más al frente y en el centro en 2018, tanto en conversaciones comerciales como personales. Algunas de las razones, sin embargo, han cambiado.\u003c/p\u003e\n\u003cp\u003ePor un lado, las tecnologías de datos (Big Data, ciencia de datos, aprendizaje automático, inteligencia artificial) continúan avanzando, llegando a ser cada vez más eficientes y también más ampliamente adoptadas en empresas de todo el mundo. No es accidental que uno de los temas clave en el mundo corporativo en 2018 haya sido la \u0026ldquo;transformación digital\u0026rdquo;. El término puede parecer pintoresco para algunos (\u0026ldquo;¿no es eso lo que ha estado sucediendo durante los últimos 25 años?\u0026ldquo;), Pero refleja que muchas de las industrias y empresas más tradicionales ahora están plenamente comprometidas en su viaje para convertirse verdaderamente en datos .\u003c/p\u003e\n\u003cp\u003ePor otro lado, una sección transversal mucho más amplia del público ha tomado conciencia de las dificultades de los datos. Ya sea a través del debate público sobre los riesgos de AI, el escándalo de Cambridge Analytica, la masiva violación de datos de Equifax, discusiones de privacidad relacionadas con GDPR o informes de creciente vigilancia gubernamental en China, el mundo de los datos ha comenzado a revelar algunos matices más oscuros y espantosos. .\u003c/p\u003e\n\u003cp\u003eAmbos son la otra cara del mismo fenómeno, que se viene gestando desde hace muchos años pero que ahora se exhibe a la perfección: prácticamente todo (ya sea personal o profesional) se digitaliza rápidamente, y las tecnologías de datos se vuelven más expertas que nunca en el procesamiento y análisis este escape masivo de datos, cada vez más en tiempo real. De esto puede resultar tanto magia como abuso. El debate sobre cómo combinar este gran poder con un sentido de responsabilidad necesario se ha vuelto esencial.\u003c/p\u003e\n\u003cp\u003eDestaquemos algunas de las tendencias y eventos clave de 2018.\u003c/p\u003e\n\u003cp\u003eInfraestructura y Analítica\u003c/p\u003e\n\u003cp\u003eDesde el punto de vista de la industria, el ecosistema de datos sigue siendo tan emocionante y vibrante como siempre, con un rico tapiz de nuevas empresas innovadoras, \u0026ldquo;ampliaciones\u0026rdquo; maduras y muchos proveedores agresivos de tecnología pública. Lo que es más importante, muchos clientes, grandes y pequeños, están desplegando esas tecnologías en producción a gran escala y cosechando un valor innegable de sus esfuerzos.\u003c/p\u003e\n\u003cp\u003eA medida que el ciclo de sustitución de las tecnologías informáticas más antiguas con productos de datos más modernos continúa, parece que el mercado de Big Data (infraestructura, análisis) está circulando a través de la mayoría de los compradores y está en transición a la mayoría tardía de la curva de adopción tradicional.\u003c/p\u003e\n\u003cp\u003e[\u003cimg src\u003d\"http://mattturck.com/wp-content/uploads/2018/06/adoption-cycle.jpg\" alt\u003d\"\" /\u003e]\u003c/p\u003e\n\u003cp\u003eAdemás, el mundo de los datos continúa su evolución inexorable hacia la nube. En realidad, es asombroso ver qué tan rápido están creciendo los grandes proveedores de nubes públicas (AWS, Azure, Google Cloud Platform, IBM), considerando que ya cada uno genera miles de millones de dólares en ingresos cada trimestre. La tendencia plantea continuas preocupaciones sobre el bloqueo de proveedores, y esto puede abrir oportunidades para startups que ofrecen soluciones de múltiples nubes. Sin embargo, hasta la fecha, incluso las empresas que adoptan estrategias de nubes múltiples tienden a depender aún de un proveedor como su proveedor principal.\u003c/p\u003e\n\u003cp\u003eA medida que siguen creciendo, los proveedores de grandes nubes compiten cada vez más entre sí ofreciendo una amplia gama de Big Data, ingeniería de datos y herramientas de aprendizaje automático a través de sus plataformas (por ejemplo, Amazon Neptune, Google AutoML, etc.), y a menudo con precios agresivos. para atraer a más desarrolladores, ya que su verdadero modelo comercial es el almacenamiento de datos. A medida que el alcance y la sofisticación de estas herramientas siguen creciendo, esto tiene un gran impacto en el panorama de la tecnología de datos, lo que hace que sea difícil para las startups competir, al menos en oportunidades horizontales amplias. Un poco más cada año, la lista de anuncios de productos en grandes conferencias anuales de vendedores en la nube (ver AWS re: Invent, por ejemplo) envía ondas de choque en la industria de inicio, ya que ponen a los vendedores en la nube en competencia directa con docenas de startups respaldadas por VC en un solo golpe. Será interesante ver cómo reaccionan los mercados públicos ante la próxima Elastic IPO, una compañía de software de código abierto que vio a Amazon lanzar a un competidor directo, Elasticsearch, hace tres años.\u003c/p\u003e\n\u003cp\u003eSin embargo, quedan muchas oportunidades para startups, siempre que estén suficientemente diferenciadas. Muchos en el espacio están escalando rápidamente, y hay una serie de segmentos particularmente interesantes y de rápido crecimiento en la parte de infraestructura y análisis del ecosistema, incluidos la transmisión en tiempo real, el gobierno de datos y los tejidos / virtualización de datos. La explosión de interés en AI también ha generado grandes oportunidades (y una gran cantidad de fondos) en chips AI, bases de datos GPU, herramientas AI devops y plataformas que permiten el despliegue de ciencia de datos y aprendizaje automático en la empresa.\u003c/p\u003e\n\u003ch3\u003eMachine Learning \u0026amp; AI\u003c/h3\u003e\n\u003cp\u003eCiertamente ha sido un año salvaje en el mundo de la investigación de la IA, con algo de la destreza de AlphaZero al increíble ritmo de lanzamiento de nuevos avances: nuevas formas de Redes de Adversarios Generacionales, nuevas Redes Corticales Recursivas de Vicarious, nuevas Capsule Networks de Geoff Hinton. Las conferencias de AI como NIPS han crecido para atraer a 8,000 personas y miles de documentos académicos se envían todos los días.\u003c/p\u003e\n\u003cp\u003eAl mismo tiempo, la búsqueda de AGI sigue siendo esquiva, tal vez afortunadamente. Gran parte de la actual ola de emoción (y miedo) sobre AI resulta del impresionante rendimiento del aprendizaje profundo desde 2012 pero, en la comunidad de investigación de IA, hay una sensación creciente de \u0026ldquo;¿y ahora qué?\u0026ldquo;, Como algunos cuestionan los fundamentos del aprendizaje profundo ( backpropagation) y otros buscan pasar de lo que consideran enfoques de \u0026ldquo;fuerza bruta\u0026rdquo; (gran cantidad de datos, mucho poder de cómputo), tal vez a favor de más enfoques basados en la neurociencia.\u003c/p\u003e\n\u003cp\u003eLejos de temer a la dominación mundial de los robots, muchos en la comunidad de investigación de la IA están preocupados de que la continua exageración del campo pueda decepcionar y conducir a otro invierno nuclear de IA.\u003c/p\u003e\n\u003cp\u003eSin embargo, al margen de la investigación en IA, recién estamos comenzando una ola de implementación y aplicación de aprendizaje profundo en el mundo real a través de una variedad de problemas que involucran reconocimiento de voz, clasificación de imágenes, reconocimiento de objetos y lenguaje en diferentes industrias. Si la parte de infraestructura y análisis del ecosistema está llegando a la mayoría tardía, todavía estamos en el territorio de los primeros adoptadores para las aplicaciones de IA vertical y empresarial.\u003c/p\u003e\n\u003cp\u003eLa explosión del Cámbrico de startups de aprendizaje profundo que comenzó hace uno o dos años ha continuado sin cesar, a pesar de que el mercado de la IA está (posiblemente) mostrando signos de finalmente enfriarse. Las expectativas, tamaños redondos y valoraciones siguen siendo altos, pero ciertamente estamos más allá de la fase en la que las grandes compañías de Internet tomarían muy temprano las nuevas empresas de IA a precios altos solo para el talento. El aire también se está aclarando un poco y revela startups \u0026ldquo;reales\u0026rdquo; de IA, en comparación con otras compañías que aprovecharon el bombo. Algunas de las startups de IA que se fundaron en el período 2014-2016 están comenzando a alcanzar la escala inicial, y muchas ofrecen productos cada vez más interesantes en industrias y sectores como la salud, las finanzas, la \u0026ldquo;industria 4.0\u0026rdquo; y la automatización de back office. El aprendizaje profundo continuará aportando mucho valor en las aplicaciones del mundo real en los próximos años, y las startups de inteligencia artificial con enfoque vertical tienen muchas oportunidades grandes por delante.\u003c/p\u003e\n\u003cp\u003eEsta explosión continua es un fenómeno global, con Canadá, Francia, Alemania, el Reino Unido e Israel siendo particularmente activos. Sin embargo, China parece estar jugando a un nivel completamente diferente en IA, con informes de agrupamiento de datos liderado por el gobierno a escala alucinante (en empresas de Internet y municipalidades), avances rápidos en áreas como el reconocimiento facial y los chips AI, y gigantescas rondas de financiación para sus startups: según CB Insights, China representó solo el 9% de la cuota global de AI, pero casi el 48% de la financiación mundial de AI en 2017, frente al 11% en 2016 (ver algunos ejemplos a continuación).\u003c/p\u003e\n\u003cp\u003eEn el mismo sentido, las cuestiones de privacidad de datos (y propiedad y seguridad) están surgiendo como una gran preocupación en todo el mundo. En los primeros días de Internet, la privacidad de los datos se trataba de proteger lo que hacíamos en línea, una parte comparativamente pequeña de nuestras actividades. En consecuencia, solo una pequeña (aunque vocal y apasionada) minoría de personas realmente se preocupó. Como casi todos los aspectos de nuestra vida personal y profesional ahora están conectados a Internet a través de una gama cada vez mayor de dispositivos conectados, lo que está en juego está cambiando. Con su capacidad para detectar anomalías en conjuntos de datos masivos, predecir resultados y reconocer rostros, AI está agravando el problema de privacidad de datos.\u003c/p\u003e\n\u003cp\u003eUna preocupación separada pero relacionada es que gran parte de esta información es propiedad de grandes compañías de Internet (GAFA). Algunos, como Facebook, han demostrado ser un mayordomo menos que perfecto. No obstante, estos datos les proporcionan una ventaja injusta en la carrera por producir IA cada vez más poderosa.\u003c/p\u003e\n\u003cp\u003eContra estos temas, un tema emergente es pensar en la cadena de bloques como una posible lámina contra los riesgos de la IA, así como una manera para que otros, fuera de GAFA, produzcan una gran inteligencia artificial. La criptoeconomía se ve como una forma de incentivar a las personas a proporcionar sus datos personales y para que los ingenieros de aprendizaje automático construyan modelos procesando estos datos de forma anónima. Todo sigue siendo muy experimental, pero están surgiendo algunos mercados y redes tempranas\u003c/p\u003e\n\u003ch3\u003eEl paisaje 2018\u003c/h3\u003e\n\u003cp\u003eSin más preámbulos, aquí está nuestro paisaje 2018.\u003c/p\u003e\n\u003cp\u003eNota bastante semántica: los términos de moda van y vienen. Menos personas hablan sobre \u0026ldquo;Big Data\u0026rdquo;, muchas más sobre \u0026ldquo;AI\u0026rdquo;, a menudo para describir la misma realidad. En consecuencia, hemos cambiado ligeramente el nombre de nuestro paisaje de 2018: ahora se llama el paisaje \u0026ldquo;Big Data \u0026amp; AI\u0026rdquo;.\u003c/p\u003e\n\u003ch3\u003eQuién entra, quién sale\u003c/h3\u003e\n\u003cp\u003eEn el frente de salida, el año pasado (desde nuestro paisaje de 2017) se ha visto sólido, pero no extraordinariamente fuerte.\u003c/p\u003e\n\u003cp\u003eAlgunas compañías clave que aparecen en el paisaje se hicieron públicas, en particular Cloudera, MongoDB Pivotal y Zuora. Otros se están preparando para salir al momento de escribir esto, como Elastic.\u003c/p\u003e\n\u003cp\u003eTambién se produjeron algunas adquisiciones notables, incluyendo en particular Mulesoft (adquirido por Salesforce post-IPO, por $ 6.5B), Flatiron Health (adquirido por Roched por $ 2.1B), Appnexus (adquirido por AT \u0026amp; T por $ 1.6B), Syncsort y Vision Solutions (adquiridas por por $ 1.2B por Centerbridge Partners), Moat (adquirido por Oracle por $ 850M), Integral Ad Science (adquirido por Vista Equity Partners por $ 850M), eVestment (adquirido por NASDAQ por $ 705M) y Kensho (adquirido por S \u0026amp; P Global por $ 550 METRO). Vale la pena señalar que, aparte de Mulesoft, todas esas empresas tienen su sede en la costa este (Nueva York, Boston y Atlanta).\u003c/p\u003e\n\u003cp\u003eMuchas otras compañías también fueron adquiridas por montos menores: Gigya (SAP), Blue River Technology (Deere \u0026amp; Co), CoreOS (Red Hat), Guavus (Thales), Lattice Data (Apple), Socrata (Tyler Technologies) y PracticeFusion (AllScripts). )\u003c/p\u003e\n\u003cp\u003eEn el frente de inversión, este fue un año de grandes rondas de financiamiento para algunas startups de Big Data e IA, particularmente en China, con una cantidad de inversiones de gran tamaño que incluyen Bytedance ($ 3B en total en 2 rondas en 2017), NIO ($ 1.6B en todo dos rondas en 2017) y SenseTime ($ 850M en dos en 2017 y 2018).\u003c/p\u003e\n\u003cp\u003eLas principales rondas de compañías estadounidenses que aparecen en el paisaje incluyen Snowflake Computing ($ 263M Serie A - vea nuestro reciente chat junto a la chimenea en Data Driven NYC), Cohesity ($ 250M Serie D), Dataminr ($ 221M Serie E), Affirm ($ 200M Series E), Rubrik ($ 180M Serie D), Qualtrics ($ 180M Serie C - vea un chat anterior pero relevante en Data Driven NYC), Tanium ($ 180M serie de capital privado), ThoughtSpot ($ 145M Serie D) y Coveo (Ronda de capital privado de $ 100 millones) y C3IoT (serie F de $ 100 millones).\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://mattturck.com/bigdata2018/\" title\u003d\"mattturck 2018\"\u003emattturck 2018\u003c/a\u003e\n\u003cbr  /\u003e\u003ca href\u003d\"http://mattturck.com/bigdata2017/\" title\u003d\"mattturck 2017\"\u003emattturck 2017\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://mattturck.com/wp-content/uploads/2018/06/Matt-Turck-FirstMark-Big-Data-Landscape-2018.png\" title\u003d\"Big Data Landscape 2018\"\u003e\u003cimg src\u003d\"http://mattturck.com/wp-content/uploads/2018/06/Matt-Turck-FirstMark-Big-Data-Landscape-2018.png\" alt\u003d\"\" /\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eotros recursos a revisar:\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"https://link.springer.com/content/pdf/10.1007%2Fs10021-016-0075-y.pdf\"\u003e1\u003c/a\u003e\n\u003cbr  /\u003e\u003ca href\u003d\"https://www.nature.com/articles/527S16a\"\u003e2\u003c/a\u003e\n\u003cbr  /\u003e\u003ca href\u003d\"http://www.uazone.org/demch/worksinprogress/sne-2013-02-techreport-bdaf-draft02.pdf\"\u003e3\u003c/a\u003e\n\u003cbr  /\u003e\u003ca href\u003d\"https://www.pentahoworld.com/sites/default/files/2017-11/Understanding-the-Big-Data-Technology-Ecosystem-PWorld2017_0.pdf\"\u003e4\u003c/a\u003e\n\u003cbr  /\u003e\u003ca href\u003d\"https://bigdataecosystem.knowledgent.com/big-data-ecosystem/#\"\u003e5!\u003c/a\u003e\n\u003cbr  /\u003e\u003ca href\u003d\"https://interset.com/2018/01/23/big-data-tech-explained-part-1/\"\u003e6\u003c/a\u003e\n\u003cbr  /\u003e\u003ca href\u003d\"https://interset.com/2018/01/30/big-data-tech-part-2/\"\u003e7\u003c/a\u003e\u003c/p\u003e\n"
          }
        ]
      },
      "apps": [],
      "jobName": "paragraph_1530217105158_-973283094",
      "id": "20180628-201825_726803088",
      "dateCreated": "Jun 28, 2018 8:18:25 PM",
      "dateStarted": "Jun 28, 2018 9:19:40 PM",
      "dateFinished": "Jun 28, 2018 9:19:40 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "user": "anonymous",
      "config": {},
      "settings": {
        "params": {},
        "forms": {}
      },
      "apps": [],
      "jobName": "paragraph_1530217201740_-786725850",
      "id": "20180628-202001_1451533712",
      "dateCreated": "Jun 28, 2018 8:20:01 PM",
      "status": "READY",
      "progressUpdateIntervalMs": 500
    }
  ],
  "name": "El ecosistema de Big Data",
  "id": "2DK27K9S6",
  "angularObjects": {
    "2CHS8UYQQ:shared_process": [],
    "2C8A4SZ9T_livy2:shared_process": [],
    "2CK8A9MEG:shared_process": [],
    "2CKAY1A8Y:shared_process": [],
    "2C4U48MY3_spark2:shared_process": [],
    "2CKEKWY8Z:shared_process": []
  },
  "config": {},
  "info": {}
}