{
  "paragraphs": [
    {
      "text": "%md\n\n# El ecosistema de Big Data \n\nBig Data no es solo un problema de base de datos o una herramienta en particular, es todo el complejo de componentes para almacenar, procesar, visualizar y entregar resultados a las aplicaciones de destino. Todo este complejo interrelacionado se puede definir como el ecosistema de Big Data que se ocupa de la evolución de los datos, los modelos y la infraestructura requerida durante todo el ciclo de vida de Big Data.\n\nEl ecosistema de Big Data es demasiado grande, complejo y redundante. Es un mercado confuso para las personas y empresas que han aceptado la idea del Big Data, pero luego tropiezan cuando se enfrentan a demasiadas decisiones en numerosas capas de la tecnología. Resulta sumamente difícil describir todas las tecnologías que componen el ecosistema de Big Data, es por esto que dichas tecnologías han sido divididas en diferentes categorías y estas a su vez se han llegado a dividir en áreas mas especificas. A continuación se definen algunas de las categorías y componentes más importantes que abordan los diferentes aspectos del ecosistema de Big Data:\n\n---\n\n## Tipos de datos\n\nLas diferentes etapas de la transformación de Big Data requieren y utilizan diferentes estructuras de datos, modelos y formatos.\n\n\u003cbr\u003e\n\n\u003cp\u003e\n\u003cimg align\u003d\"left\" width\u003d\"700\" height\u003d\"350\" src\u003d\"https://dtflaneur.files.wordpress.com/2013/02/svuns.png?w\u003d700\"\u003e\n\u003c/p\u003e\n\n\n* **Datos estructurados**: Los datos estructurados se refieren a todos los datos que se pueden almacenar una base de datos relacional, en tablas con filas y columnas. Tienen una clave relacional y se pueden mapear fácilmente en campos prediseñados. La información estructurada es relativamente simple de ingresar, almacenar, consultar y analizar, pero debe estar estrictamente definida en términos de nombre y tipo de campo.\n\n* **Datos no estructurados**: Los datos no estructurados pueden tener su propia estructura interna, pero no se ajustan perfectamente a una hoja de cálculo o base de datos. El desafío fundamental de las fuentes de datos no estructurados es que son difíciles de descifrar, comprender y preparar para el uso analítico.\n\n* **Datos semiestructurados**: Los datos semiestructurados son información que no reside en una base de datos relacional pero que tiene algunas propiedades organizacionales que hacen que sea más fácil de analizar. Por ejemplo los archivos CSV, XML y JSON son documentos semiestructurados y las bases de datos NoSQL se consideran semiestructuradas.\n\n\u003cbr\u003e\n\n---\n\n### Bases de datos\n\n\u003cbr\u003e\n\n\u003cp align\u003d\"center\"\u003e\n\u003cimg  src\u003d\"https://blog.couchbase.com/wp-content/uploads/2017/04/nosql-vs-sql-overview-1.png\"\u003e\n\u003c/p\u003e\n\n* **Bases de datos relacionales**: Bases de datos operacionales para aplicaciones OLTP que requieren altas cargas de transacciones y concurrencia del usuario. Puede \"ampliarse\" a volúmenes de datos, pero no tiene la capacidad de \"escalar horizontalmente\" para el procesamiento de datos de gran tamaño. Poseen un esquema estructurado de tablas que contienen filas y columnas de datos que enfatizan la integridad y la coherencia sobre la velocidad y la escala. Datos estructurados a los que se accede con el lenguaje de consulta SQL. Algunas de las más populares son SQL Server, Oracle, MySQL , PostGreSQL, IBM DB2.\n\n* **Base de datos analíticas**: Esquema estructurado de tablas que contiene filas y columnas de datos que ofrecen velocidad y escalabilidad mejoradas en RDBMS, pero que aún se limitan a datos estructurados. Los esquemas rígidos con consultas SQL orientadas a lotes no están diseñados para aplicaciones de streaming. Algunas de las más populares son Oracle Exadata, IBM Netezza, EMC Greenplum, Vertica.\n\n* **Bases de datos NoSQL**: Bueno para aplicaciones web, código de aplicación web sin escritura, depuración y mantenimiento. Escale el escalado horizontal con datos automáticos para admitir a millones de usuarios de aplicaciones web. Compromiso de coherencia (transacciones ACID) a favor de la escala y el tiempo de actividad. El diseño sin esquema permite una ingesta rápida o continua a escala. Buena opción de almacenamiento para alto rendimiento, bajos requisitos de latencia de aplicaciones de transmisión para vistas de datos en tiempo real. Visto como un componente clave de la arquitectura Lambda. Algunas de las más populares son: MongoDB, HBase, Cassandra, MarkLogic, Couchbase.\n\n* **Bases de datos NewSQL**: Corresponde a un nuevo (relativamente) tipo de base de datos que se considera un nuevo paradigma de base de datos RDBMS, en el que se aplican las lecciones aprendidas de las bases de datos NoSQL en el mundo SQL. Están pensadas principalmente para aplicaciones que requieren gestionar gran cantidad de registros, pero con la consistencia que ofrecen las RDBMS y mediante lenguaje SQL. Con respecto a este tipo de bases de datos, hay dos variantes: las que se han creado desde el principio con este concepto (VoltDB, MemSQL, etc.) y las que se han adaptado a este requisito, como es el caso de MySQL Cluster. Algunas de las más populares son Altibase, c-treeACE, CockroachDB, NuoDB, VoltDB.\n\n* **Bases de datos orientadas a grafos**: Una base de datos orientada a grafos (graph database) representa la información como nodos de un grafo y sus relaciones con las aristas del mismo, de manera que se pueda usar teoría de grafos para recorrer la base de datos ya que esta puede describir atributos de los nodos (entidades) y las aristas (relaciones). Algunas son ArangoDB, Graphbase, Neoj, AllegroGraph, entre otras.\n\n* **Bases de datos MPP**: Una base de datos MPP (massively parallel processing) es una base de datos que está optimizada para procesarse en paralelo para que muchas unidades de procesamiento realicen muchas operaciones a la vez. Algunas son MemSQL, Teradata, Vertica, entre otras.\n\n---\n\n## Lenguajes de programación\n\n\u003cbr\u003e\n\n\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https://cdn-images-1.medium.com/max/1600/1*PPIp7twJJUknfohZqtL8pQ.png\"\u003e\n\n* **Python**: Python es un lenguaje de programación fácil de aprender, identifica y asocia automáticamente tipos de datos y sigue una estructura de anidamiento basada en indentación. Tiene su disposición una gran cantidad de librerías para trabajar con Big Data como PyDoop , PySpark, NumPy, Pandas, Scipy entre otras.\n\n\n\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https://www.scala-lang.org/resources/img/frontpage/scala-logo-white@2x.png\"\u003e\n\n* **Scala**: Scala combina programación orientada a objetos y funcional en un lenguaje conciso y de alto nivel. Los tipos estáticos de Scala ayudan a evitar errores en aplicaciones complejas, y sus tiempos de ejecución de JVM y JavaScript le permiten construir sistemas de alto rendimiento con fácil acceso a un enorme ecosistema de bibliotecas.\n\n\u003cimg  height\u003d\"100\" width\u003d\"140\" src\u003d\"https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/R_logo.svg/724px-R_logo.svg.png\"\u003e\n\n* **R**: R es un entorno y lenguaje de programación con un enfoque al análisis estadístico. Se trata de uno de los lenguajes más utilizados en investigación por la comunidad estadística, siendo además muy popular en el campo de la minería de datos, la investigación biomédica, la bioinformática y las matemáticas financieras.\n\n---\n### Motores de ejecución\n\n\u003cbr\u003e\n\n\u003cimg height\u003d\"100\" width\u003d\"300\" src\u003d\"https://lh6.googleusercontent.com/XeINihIXJLU3b2TH6HsottOgPnyVljd0nsjbkFgxPVxa2Bu8gDntmPFJT6GlYTC1qDwOzQ3Zatdwhw\u003dw1680-h944\"\u003e\n\n* **Apache Hadoop** : Es un framework de código abierto de Apache escrito en java que permite el procesamiento distribuido de grandes conjuntos de datos en grupos de computadores utilizando modelos de programación simples. Una aplicación que trabaja en Hadoop funciona en un entorno que proporciona almacenamiento distribuido y computación entre clusters de computadoras. Hadoop está diseñado para escalar desde un único servidor a miles de máquinas, cada una de las cuales ofrece cómputo y almacenamiento local. Los componentes principales de Hadoop son:\n\n    * **HDFS** : Es un sistema de archivos distribuidos y tolerante a fallas, diseñado para convertir un grupo de servidores estándar en un grupo de almacenamiento de escalamiento masivo. Desarrollado específicamente para cargas de trabajo de procesamiento de datos a gran escala donde la escalabilidad, la flexibilidad y el rendimiento son críticos.\n    \n    * **MapReduce** : MapReduce es el corazón de Apache Hadoop. Es este paradigma de programación que permite una escalabilidad masiva en cientos o miles de servidores en un clúster de Hadoop, permite escribir fácilmente aplicaciones que procesan grandes cantidades de datos en paralelo en grandes clusters (miles de nodos) de hardware básico de una manera confiable y tolerante a fallas.\n    \n    * **YARN** : Es un framework para la programación de trabajos y la administración de recursos del clúster. Proporciona administración de recursos de código abierto para Hadoop, por lo que puede ir más allá del procesamiento por lotes y abrir sus datos a un conjunto diverso de cargas de trabajo, que incluyen SQL interactivo, modelado avanzado y transmisión en tiempo real.\n    \n\u003cimg  height\u003d\"100\" src\u003d\"https://lh6.googleusercontent.com/W0ONjRetitE3LX6xWYoxd3eUK8apdT5A_H2CYCl6zyv6rC4BoLoag-Rvhv3YDabIQLd_7sUpz3akpg\u003dw1680-h944\"\u003e\n\n* **Apache Tez**: Apache Tez es un framework extensible para la construcción de lotes de alto rendimiento y aplicaciones interactivas de procesamiento de datos, coordinado por YARN en Apache Hadoop. Tez mejora el paradigma MapReduce al mejorar drásticamente su velocidad, al tiempo que mantiene la capacidad de MapReduce para escalar a petabytes de datos.\n\n\u003cimg  height\u003d\"100\" src\u003d\"https://lh4.googleusercontent.com/ibBRAUkBuhKbZI_27Jdu8b0fGMVbnNgewqjRbjiW7qT1Y98gThLBpxFc6L8ed1ndkCTdE1OQQCV0EA\u003dw1680-h944\"\u003e\n\n* **Apache Spark**: Es un motor rápido de procesamiento de datos en memoria con APIs de desarrollo elegantes y expresivas para permitir a los trabajadores de datos ejecutar de manera eficiente la transmisión, el aprendizaje automático o las cargas de trabajo SQL que requieren un acceso iterativo rápido a los conjuntos de datos. Con Spark funcionando en Apache Hadoop YARN, los desarrolladores de todo el mundo ahora pueden crear aplicaciones para explotar el poder de Spark, obtener ideas y enriquecer sus cargas de trabajo de ciencia de datos dentro de un solo conjunto de datos compartido en Hadoop.\n\n\u003cimg  height\u003d\"100\" src\u003d\"https://data-artisans.com/wp-content/uploads/2017/02/flink-logo-large.jpg\"\u003e\n\n* **Apache Flink**: Apache Flink (en alemán significa \"rápido\") es un framework de Big Data para el procesamiento de datos por lotes y en streaming. Permite a los desarrolladores construir pipelines de procesamiento de datos complejas y ejecutarlas en un entorno distribuido. Proporciona un soporte de primera clase para el procesamiento en streaming e implementa el procesamiento por lotes como un caso especial.\n\n---\n\n## Gestión de clusters\n\n\u003cbr\u003e\n\n\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"http://errequeerre.es/wp-content/uploads/2017/09/hadoop-yarn-300x191.png\"\u003e\n\n* **Hadoop YARN**: Hadoop YARN, un framework informático distribuido para la programación de trabajos y gestión de recursos de clúster, tiene alta disponibilidad para masters y esclavos, soporte para contenedores Docker en modo no seguro, ejecutores de contenedores Linux y Windows en modo seguro y un programador conectable.\n\n\n\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https://opencredo.com/wp-content/uploads/2015/12/apache-mesos.png\"\u003e\n\n* **Apache Mesos**: Apache Mesos, un kernel de sistemas distribuidos, puede administrar recursos por aplicación y tiene soporte para contenedores Docker. Puede ejecutar trabajos Spark, Hadoop MapReduce o cualquier otra aplicación de servicio. Tiene API para Java, Python y C ++.\n\n\u003cimg  height\u003d\"250\" width\u003d\"400\" src\u003d\"https://sharebigdata.files.wordpress.com/2016/01/clustermode.png\"\u003e\n\n* **Spark Standalone**: El administrador de clúster Spark Standalone es un administrador de clúster simple disponible como parte de la distribución de Spark. Es resistente a las fallas de los workes nodes, tiene capacidades para administrar recursos por aplicación, y se puede ejecutar junto con una implementación de Hadoop existente y acceder a los datos de HDFS.\n\n\n---\n\n## Streaming\n\n\u003cbr\u003e\n\n\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https://lh3.googleusercontent.com/CgQNPQ6S2O_9k-Ag45VSe3l8rYQ1a8cGd8kjzMAyYryNSpu3Fx_zw2ju5j1qICpq6BXopRH-_O0IVw\u003dw1680-h944\"\u003e\n\n* **Apache Storm**: Apache Storm es un sistema de computación distribuido, tolerante a fallas y de código abierto. Storm procesa flujos de datos en tiempo real con Hadoop. Las soluciones de Storm también pueden proporcionar un procesamiento de datos garantizado, con la capacidad de reproducir datos que no se procesaron correctamente la primera vez.\n\n\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Apache-nifi-logo.svg/512px-Apache-nifi-logo.svg.png\"\u003e\n\n* **Apache Nifi**: Apache NiFi es una plataforma integrada de logística de datos para automatizar el movimiento de datos entre sistemas dispares. Proporciona control en tiempo real que facilita la gestión del movimiento de datos entre cualquier fuente y cualquier destino.\n\n\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https://i1.wp.com/www.clubdetecnologia.net/wp-content/uploads/2017/11/apache-kafka.png?resize\u003d768%2C193\"\u003e\n\n* **Apache Kafka**: Apache Kafka es una plataforma de transmisión distribuida capaz de manejar billones de eventos al día. Inicialmente concebido como una cola de mensajes, Kafka se basa en una abstracción de un registro de compromiso distribuido.\n\n---\n\n## Machine Learning\n\n\u003cbr\u003e\n\n\u003cimg  height\u003d\"150\" width\u003d\"200\" src\u003d\"https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/TensorFlowLogo.svg/348px-TensorFlowLogo.svg.png\"\u003e\n\n* **TensorFlow**: TensorFlow es una biblioteca de código abierto que se basa en un sistema de redes neuronales. Esto significa que puede relacionar varios datos en red simultáneamente, de la misma forma que lo hace el cerebro humano. Por ejemplo, puede reconocer varias palabras del alfabeto porque relaciona las letras y fonemas.\n\n\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"https://stradata.co/wp-content/uploads/2017/02/Mahout.jpg\"\u003e\n\n* **Mahout**: Apache Mahout es un proyecto de la Apache Software Foundation para producir implementaciones gratuitas de algoritmos de aprendizaje automático distribuidos o escalables, enfocados principalmente en las áreas de filtrado colaborativo, clustering y clasificación. Muchas de las implementaciones usan la plataforma Apache Hadoop.\n\n\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https://www.woodmark.de/blog/wp-content/uploads/2017/09/Spark-vs-flink-300x85.jpg\"\u003e\n\n* **Spark \u0026 Flink**: Spark tiene su propia libreria de aprendizaje automático,la cual es, MLlib. Los algoritmos de aprendizaje automático son muy rápidos, eficientes y optimizados en Spark gracias a la computación en memoria. Flink tiene la FlinkML, que es la libreria de Machine Learning para Flink. Los algoritmos de aprendizaje automático son muy rápidos, eficientes y optimizados en Flink debido a su soporte nativo para el procesamiento iterativo y la computación en memoria.\n\n---\n\n## Big data como servicio\n\n\u003cbr\u003e\n\n\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/AmazonWebservices_Logo.svg/580px-AmazonWebservices_Logo.svg.png\"\u003e\n\n* **AWS**: Amazon Web Services (AWS) es una colección de servicios de cómputo remoto, también llamados servicios web que juntos conforman una plataforma de computación en la nube de Amazon.com desde 2006. Los más conocidos y centrales de estos servicios son Amazon EC2 y Amazon S3. También cuenta con servicios orientados a Big data como Amazon EMR, Amazon Elasticsearch Service y Amazon Athena.\n\n\n\u003cimg  height\u003d\"100\" width\u003d\"180\" src\u003d\"http://www.aionsolution.com/wp-content/uploads/2017/10/microsoft-azure-640x401.png\"\u003e\n\n* **Microsoft Azure**: HDInsight de Microsoft Azure es una distribución de Hadoop que funciona en la nube. HDInsight fue diseñado para manejar cualquier cantidad de datos, escalando de terabytes a petabytes bajo demanda. Puede cambiar la cantidad de nodos en cualquier momento y solo se cobra por el cálculo y el almacenamiento que realmente se usa.\n\n\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https://cloud.google.com/_static/6d893b1b39/images/cloud/cloud-logo.svg\"\u003e\n\n* **Cloud Dataflow**: Google Cloud Dataflow es un servicio en la nube totalmente administrado para crear y evaluar pipelines de procesamiento de datos escalables. Los flujos de datos de los pipelines se basan en el modelo de programación Apache Beam y pueden operar tanto en modo por lotes como en streaming.\n\n---\n\n## Distribuidores de Hadoop\n\n\u003cbr\u003e\n\n\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"http://www.fuzzylogix.com/wp-content/uploads/cloudera-logo.png\"\u003e\n\n* **Cloudera**: Cloudera Inc. es una compañía de software con sede en los Estados Unidos que ofrece software, soporte y servicios basados ​​en Apache Hadoop y capacitación para clientes comerciales. La distribución de Apache Hadoop de código abierto de Cloudera, CDH (Cloudera Distribution incluyendo Apache Hadoop), apunta a implementaciones de clase empresarial de esa tecnología.\n\n\n\u003cimg  height\u003d\"100\" width\u003d\"180\" src\u003d\"https://hortonworks.com/wp-content/themes/hortonworks/images/svg/ui_logo.svg\"\u003e\n\n* **Hortonworks**: Hortonworks es una empresa de software de computadoras con sede en Palo Alto, California. La compañía se enfoca en el desarrollo y soporte de Apache Hadoop, un framework que permite el procesamiento distribuido de grandes conjuntos de datos en grupos de computadoras.\n\n\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"https://mapr.com/assets/images/MapR_logo_red.svg\"\u003e\n\n* **MapR Technologies**: MapR es una empresa de software empresarial con sede en San José, California, que desarrolla y vende software derivado de Apache Hadoop. La compañía contribuye a \n* proyectos de Apache Hadoop como HBase, Pig, Apache Hive y Apache ZooKeeper.\n\n---\n\n## Seguridad\n\n\u003cbr\u003e\n\n\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https://www.protegrity.com/wp-content/uploads/2017/02/apache-ranger-logo.png\"\u003e\n\n* **Apache Ranger**: Ranger es un framework para habilitar, controlar y gestionar la seguridad de datos integral en toda la plataforma Hadoop.\n\n\n\u003cimg  height\u003d\"100\" width\u003d\"180\" src\u003d\"https://dcassetcdn.com/design_img/343044/36801/36801_2851300_343044_image.png\"\u003e\n\n* **Sentry**: Apache Sentry es un sistema altamente modular para proporcionar una autorización basada en funciones de granularidad fina a datos y metadatos almacenados en un clúster Apache Hadoop.\n\n\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"https://jaxenter.de/wp-content/uploads/2014/04/knox.jpg\"\u003e\n\n* **Knox**: MApache Knox Gateway es una puerta de enlace API REST para interactuar con clústeres de Hadoop. Knox Gateway proporciona un único punto de acceso para todas las interacciones REST con clústeres de Hadoop.\n\n---\n\nPara no entrar en detalle de otras áreas más especificas, a continuación se anexan un par de fuentes donde se pueden detallar los demás componentes que conforman el ecosistema actual de Big Data.\n\n\u003cp align\u003d\"center\"\u003e\n  \u003cimg src\u003d\"http://mattturck.com/wp-content/uploads/2018/06/Matt-Turck-FirstMark-Big-Data-Landscape-2018.png\"\u003e\n\u003c/p\u003e\n\n[Bigdata2018](http://mattturck.com/bigdata2018/ \"mattturck 2018\")\n\n[Bigdataecosystem](https://bigdataecosystem.knowledgent.com/big-data-ecosystem/#)\n\n [Pentahoworld](https://www.pentahoworld.com/sites/default/files/2017-11/Understanding-the-Big-Data-Technology-Ecosystem-PWorld2017_0.pdf)\n\n\n",
      "user": "anonymous",
      "dateUpdated": "Jul 9, 2018 3:17:08 PM",
      "config": {
        "colWidth": 12.0,
        "enabled": true,
        "results": {},
        "editorSetting": {
          "editOnDblClick": true,
          "language": "markdown"
        },
        "editorMode": "ace/mode/markdown",
        "editorHide": true,
        "tableHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "results": {
        "code": "SUCCESS",
        "msg": [
          {
            "type": "HTML",
            "data": "\u003ch1\u003eEl ecosistema de Big Data\u003c/h1\u003e\n\u003cp\u003eBig Data no es solo un problema de base de datos o una herramienta en particular, es todo el complejo de componentes para almacenar, procesar, visualizar y entregar resultados a las aplicaciones de destino. Todo este complejo interrelacionado se puede definir como el ecosistema de Big Data que se ocupa de la evolución de los datos, los modelos y la infraestructura requerida durante todo el ciclo de vida de Big Data.\u003c/p\u003e\n\u003cp\u003eEl ecosistema de Big Data es demasiado grande, complejo y redundante. Es un mercado confuso para las personas y empresas que han aceptado la idea del Big Data, pero luego tropiezan cuando se enfrentan a demasiadas decisiones en numerosas capas de la tecnología. Resulta sumamente difícil describir todas las tecnologías que componen el ecosistema de Big Data, es por esto que dichas tecnologías han sido divididas en diferentes categorías y estas a su vez se han llegado a dividir en áreas mas especificas. A continuación se definen algunas de las categorías y componentes más importantes que abordan los diferentes aspectos del ecosistema de Big Data:\u003c/p\u003e\n\u003chr /\u003e\n\u003ch2\u003eTipos de datos\u003c/h2\u003e\n\u003cp\u003eLas diferentes etapas de la transformación de Big Data requieren y utilizan diferentes estructuras de datos, modelos y formatos.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003e\n\u003cimg align\u003d\"left\" width\u003d\"700\" height\u003d\"350\" src\u003d\"https://dtflaneur.files.wordpress.com/2013/02/svuns.png?w\u003d700\"\u003e\n\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eDatos estructurados\u003c/strong\u003e: Los datos estructurados se refieren a todos los datos que se pueden almacenar una base de datos relacional, en tablas con filas y columnas. Tienen una clave relacional y se pueden mapear fácilmente en campos prediseñados. La información estructurada es relativamente simple de ingresar, almacenar, consultar y analizar, pero debe estar estrictamente definida en términos de nombre y tipo de campo.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eDatos no estructurados\u003c/strong\u003e: Los datos no estructurados pueden tener su propia estructura interna, pero no se ajustan perfectamente a una hoja de cálculo o base de datos. El desafío fundamental de las fuentes de datos no estructurados es que son difíciles de descifrar, comprender y preparar para el uso analítico.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eDatos semiestructurados\u003c/strong\u003e: Los datos semiestructurados son información que no reside en una base de datos relacional pero que tiene algunas propiedades organizacionales que hacen que sea más fácil de analizar. Por ejemplo los archivos CSV, XML y JSON son documentos semiestructurados y las bases de datos NoSQL se consideran semiestructuradas.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr /\u003e\n\u003ch3\u003eBases de datos\u003c/h3\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp align\u003d\"center\"\u003e\n\u003cimg  src\u003d\"https://blog.couchbase.com/wp-content/uploads/2017/04/nosql-vs-sql-overview-1.png\"\u003e\n\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eBases de datos relacionales\u003c/strong\u003e: Bases de datos operacionales para aplicaciones OLTP que requieren altas cargas de transacciones y concurrencia del usuario. Puede \u0026ldquo;ampliarse\u0026rdquo; a volúmenes de datos, pero no tiene la capacidad de \u0026ldquo;escalar horizontalmente\u0026rdquo; para el procesamiento de datos de gran tamaño. Poseen un esquema estructurado de tablas que contienen filas y columnas de datos que enfatizan la integridad y la coherencia sobre la velocidad y la escala. Datos estructurados a los que se accede con el lenguaje de consulta SQL. Algunas de las más populares son SQL Server, Oracle, MySQL , PostGreSQL, IBM DB2.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eBase de datos analíticas\u003c/strong\u003e: Esquema estructurado de tablas que contiene filas y columnas de datos que ofrecen velocidad y escalabilidad mejoradas en RDBMS, pero que aún se limitan a datos estructurados. Los esquemas rígidos con consultas SQL orientadas a lotes no están diseñados para aplicaciones de streaming. Algunas de las más populares son Oracle Exadata, IBM Netezza, EMC Greenplum, Vertica.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eBases de datos NoSQL\u003c/strong\u003e: Bueno para aplicaciones web, código de aplicación web sin escritura, depuración y mantenimiento. Escale el escalado horizontal con datos automáticos para admitir a millones de usuarios de aplicaciones web. Compromiso de coherencia (transacciones ACID) a favor de la escala y el tiempo de actividad. El diseño sin esquema permite una ingesta rápida o continua a escala. Buena opción de almacenamiento para alto rendimiento, bajos requisitos de latencia de aplicaciones de transmisión para vistas de datos en tiempo real. Visto como un componente clave de la arquitectura Lambda. Algunas de las más populares son: MongoDB, HBase, Cassandra, MarkLogic, Couchbase.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eBases de datos NewSQL\u003c/strong\u003e: Corresponde a un nuevo (relativamente) tipo de base de datos que se considera un nuevo paradigma de base de datos RDBMS, en el que se aplican las lecciones aprendidas de las bases de datos NoSQL en el mundo SQL. Están pensadas principalmente para aplicaciones que requieren gestionar gran cantidad de registros, pero con la consistencia que ofrecen las RDBMS y mediante lenguaje SQL. Con respecto a este tipo de bases de datos, hay dos variantes: las que se han creado desde el principio con este concepto (VoltDB, MemSQL, etc.) y las que se han adaptado a este requisito, como es el caso de MySQL Cluster. Algunas de las más populares son Altibase, c-treeACE, CockroachDB, NuoDB, VoltDB.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eBases de datos orientadas a grafos\u003c/strong\u003e: Una base de datos orientada a grafos (graph database) representa la información como nodos de un grafo y sus relaciones con las aristas del mismo, de manera que se pueda usar teoría de grafos para recorrer la base de datos ya que esta puede describir atributos de los nodos (entidades) y las aristas (relaciones). Algunas son ArangoDB, Graphbase, Neoj, AllegroGraph, entre otras.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eBases de datos MPP\u003c/strong\u003e: Una base de datos MPP (massively parallel processing) es una base de datos que está optimizada para procesarse en paralelo para que muchas unidades de procesamiento realicen muchas operaciones a la vez. Algunas son MemSQL, Teradata, Vertica, entre otras.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003ch2\u003eLenguajes de programación\u003c/h2\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https: //cdn-images-1.medium.com/max/1600/1*PPIp7twJJUknfohZqtL8pQ.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003ePython\u003c/strong\u003e: Python es un lenguaje de programación fácil de aprender, identifica y asocia automáticamente tipos de datos y sigue una estructura de anidamiento basada en indentación. Tiene su disposición una gran cantidad de librerías para trabajar con Big Data como PyDoop , PySpark, NumPy, Pandas, Scipy entre otras.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https: //www.scala-lang.org/resources/img/frontpage/scala-logo-white@2x.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eScala\u003c/strong\u003e: Scala combina programación orientada a objetos y funcional en un lenguaje conciso y de alto nivel. Los tipos estáticos de Scala ayudan a evitar errores en aplicaciones complejas, y sus tiempos de ejecución de JVM y JavaScript le permiten construir sistemas de alto rendimiento con fácil acceso a un enorme ecosistema de bibliotecas.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"140\" src\u003d\"https: //upload.wikimedia.org/wikipedia/commons/thumb/1/1b/R_logo.svg/724px-R_logo.svg.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eR\u003c/strong\u003e: R es un entorno y lenguaje de programación con un enfoque al análisis estadístico. Se trata de uno de los lenguajes más utilizados en investigación por la comunidad estadística, siendo además muy popular en el campo de la minería de datos, la investigación biomédica, la bioinformática y las matemáticas financieras.\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003ch3\u003eMotores de ejecución\u003c/h3\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg height\u003d\"100\" width\u003d\"300\" src\u003d\"https: //lh6.googleusercontent.com/XeINihIXJLU3b2TH6HsottOgPnyVljd0nsjbkFgxPVxa2Bu8gDntmPFJT6GlYTC1qDwOzQ3Zatdwhw\u003dw1680-h944\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eApache Hadoop\u003c/strong\u003e : Es un framework de código abierto de Apache escrito en java que permite el procesamiento distribuido de grandes conjuntos de datos en grupos de computadores utilizando modelos de programación simples. Una aplicación que trabaja en Hadoop funciona en un entorno que proporciona almacenamiento distribuido y computación entre clusters de computadoras. Hadoop está diseñado para escalar desde un único servidor a miles de máquinas, cada una de las cuales ofrece cómputo y almacenamiento local. Los componentes principales de Hadoop son:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eHDFS\u003c/strong\u003e : Es un sistema de archivos distribuidos y tolerante a fallas, diseñado para convertir un grupo de servidores estándar en un grupo de almacenamiento de escalamiento masivo. Desarrollado específicamente para cargas de trabajo de procesamiento de datos a gran escala donde la escalabilidad, la flexibilidad y el rendimiento son críticos.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eMapReduce\u003c/strong\u003e : MapReduce es el corazón de Apache Hadoop. Es este paradigma de programación que permite una escalabilidad masiva en cientos o miles de servidores en un clúster de Hadoop, permite escribir fácilmente aplicaciones que procesan grandes cantidades de datos en paralelo en grandes clusters (miles de nodos) de hardware básico de una manera confiable y tolerante a fallas.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cp\u003e\u003cstrong\u003eYARN\u003c/strong\u003e : Es un framework para la programación de trabajos y la administración de recursos del clúster. Proporciona administración de recursos de código abierto para Hadoop, por lo que puede ir más allá del procesamiento por lotes y abrir sus datos a un conjunto diverso de cargas de trabajo, que incluyen SQL interactivo, modelado avanzado y transmisión en tiempo real.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" src\u003d\"https: //lh6.googleusercontent.com/W0ONjRetitE3LX6xWYoxd3eUK8apdT5A_H2CYCl6zyv6rC4BoLoag-Rvhv3YDabIQLd_7sUpz3akpg\u003dw1680-h944\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eApache Tez\u003c/strong\u003e: Apache Tez es un framework extensible para la construcción de lotes de alto rendimiento y aplicaciones interactivas de procesamiento de datos, coordinado por YARN en Apache Hadoop. Tez mejora el paradigma MapReduce al mejorar drásticamente su velocidad, al tiempo que mantiene la capacidad de MapReduce para escalar a petabytes de datos.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" src\u003d\"https: //lh4.googleusercontent.com/ibBRAUkBuhKbZI_27Jdu8b0fGMVbnNgewqjRbjiW7qT1Y98gThLBpxFc6L8ed1ndkCTdE1OQQCV0EA\u003dw1680-h944\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eApache Spark\u003c/strong\u003e: Es un motor rápido de procesamiento de datos en memoria con APIs de desarrollo elegantes y expresivas para permitir a los trabajadores de datos ejecutar de manera eficiente la transmisión, el aprendizaje automático o las cargas de trabajo SQL que requieren un acceso iterativo rápido a los conjuntos de datos. Con Spark funcionando en Apache Hadoop YARN, los desarrolladores de todo el mundo ahora pueden crear aplicaciones para explotar el poder de Spark, obtener ideas y enriquecer sus cargas de trabajo de ciencia de datos dentro de un solo conjunto de datos compartido en Hadoop.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" src\u003d\"https: //data-artisans.com/wp-content/uploads/2017/02/flink-logo-large.jpg\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eApache Flink\u003c/strong\u003e: Apache Flink (en alemán significa \u0026ldquo;rápido\u0026rdquo;) es un framework de Big Data para el procesamiento de datos por lotes y en streaming. Permite a los desarrolladores construir pipelines de procesamiento de datos complejas y ejecutarlas en un entorno distribuido. Proporciona un soporte de primera clase para el procesamiento en streaming e implementa el procesamiento por lotes como un caso especial.\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003ch2\u003eGestión de clusters\u003c/h2\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"http: //errequeerre.es/wp-content/uploads/2017/09/hadoop-yarn-300x191.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eHadoop YARN\u003c/strong\u003e: Hadoop YARN, un framework informático distribuido para la programación de trabajos y gestión de recursos de clúster, tiene alta disponibilidad para masters y esclavos, soporte para contenedores Docker en modo no seguro, ejecutores de contenedores Linux y Windows en modo seguro y un programador conectable.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https: //opencredo.com/wp-content/uploads/2015/12/apache-mesos.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eApache Mesos\u003c/strong\u003e: Apache Mesos, un kernel de sistemas distribuidos, puede administrar recursos por aplicación y tiene soporte para contenedores Docker. Puede ejecutar trabajos Spark, Hadoop MapReduce o cualquier otra aplicación de servicio. Tiene API para Java, Python y C ++.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"250\" width\u003d\"400\" src\u003d\"https: //sharebigdata.files.wordpress.com/2016/01/clustermode.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eSpark Standalone\u003c/strong\u003e: El administrador de clúster Spark Standalone es un administrador de clúster simple disponible como parte de la distribución de Spark. Es resistente a las fallas de los workes nodes, tiene capacidades para administrar recursos por aplicación, y se puede ejecutar junto con una implementación de Hadoop existente y acceder a los datos de HDFS.\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003ch2\u003eStreaming\u003c/h2\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https: //lh3.googleusercontent.com/CgQNPQ6S2O_9k-Ag45VSe3l8rYQ1a8cGd8kjzMAyYryNSpu3Fx_zw2ju5j1qICpq6BXopRH-_O0IVw\u003dw1680-h944\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eApache Storm\u003c/strong\u003e: Apache Storm es un sistema de computación distribuido, tolerante a fallas y de código abierto. Storm procesa flujos de datos en tiempo real con Hadoop. Las soluciones de Storm también pueden proporcionar un procesamiento de datos garantizado, con la capacidad de reproducir datos que no se procesaron correctamente la primera vez.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https: //upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Apache-nifi-logo.svg/512px-Apache-nifi-logo.svg.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eApache Nifi\u003c/strong\u003e: Apache NiFi es una plataforma integrada de logística de datos para automatizar el movimiento de datos entre sistemas dispares. Proporciona control en tiempo real que facilita la gestión del movimiento de datos entre cualquier fuente y cualquier destino.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https: //i1.wp.com/www.clubdetecnologia.net/wp-content/uploads/2017/11/apache-kafka.png?resize\u003d768%2C193\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eApache Kafka\u003c/strong\u003e: Apache Kafka es una plataforma de transmisión distribuida capaz de manejar billones de eventos al día. Inicialmente concebido como una cola de mensajes, Kafka se basa en una abstracción de un registro de compromiso distribuido.\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003ch2\u003eMachine Learning\u003c/h2\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg  height\u003d\"150\" width\u003d\"200\" src\u003d\"https: //upload.wikimedia.org/wikipedia/commons/thumb/1/11/TensorFlowLogo.svg/348px-TensorFlowLogo.svg.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eTensorFlow\u003c/strong\u003e: TensorFlow es una biblioteca de código abierto que se basa en un sistema de redes neuronales. Esto significa que puede relacionar varios datos en red simultáneamente, de la misma forma que lo hace el cerebro humano. Por ejemplo, puede reconocer varias palabras del alfabeto porque relaciona las letras y fonemas.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"https: //stradata.co/wp-content/uploads/2017/02/Mahout.jpg\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eMahout\u003c/strong\u003e: Apache Mahout es un proyecto de la Apache Software Foundation para producir implementaciones gratuitas de algoritmos de aprendizaje automático distribuidos o escalables, enfocados principalmente en las áreas de filtrado colaborativo, clustering y clasificación. Muchas de las implementaciones usan la plataforma Apache Hadoop.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https: //www.woodmark.de/blog/wp-content/uploads/2017/09/Spark-vs-flink-300x85.jpg\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eSpark \u0026amp; Flink\u003c/strong\u003e: Spark tiene su propia libreria de aprendizaje automático,la cual es, MLlib. Los algoritmos de aprendizaje automático son muy rápidos, eficientes y optimizados en Spark gracias a la computación en memoria. Flink tiene la FlinkML, que es la libreria de Machine Learning para Flink. Los algoritmos de aprendizaje automático son muy rápidos, eficientes y optimizados en Flink debido a su soporte nativo para el procesamiento iterativo y la computación en memoria.\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003ch2\u003eBig data como servicio\u003c/h2\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"https: //upload.wikimedia.org/wikipedia/commons/thumb/1/1d/AmazonWebservices_Logo.svg/580px-AmazonWebservices_Logo.svg.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eAWS\u003c/strong\u003e: Amazon Web Services (AWS) es una colección de servicios de cómputo remoto, también llamados servicios web que juntos conforman una plataforma de computación en la nube de Amazon.com desde 2006. Los más conocidos y centrales de estos servicios son Amazon EC2 y Amazon S3. También cuenta con servicios orientados a Big data como Amazon EMR, Amazon Elasticsearch Service y Amazon Athena.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"180\" src\u003d\"http: //www.aionsolution.com/wp-content/uploads/2017/10/microsoft-azure-640x401.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eMicrosoft Azure\u003c/strong\u003e: HDInsight de Microsoft Azure es una distribución de Hadoop que funciona en la nube. HDInsight fue diseñado para manejar cualquier cantidad de datos, escalando de terabytes a petabytes bajo demanda. Puede cambiar la cantidad de nodos en cualquier momento y solo se cobra por el cálculo y el almacenamiento que realmente se usa.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https: //cloud.google.com/_static/6d893b1b39/images/cloud/cloud-logo.svg\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eCloud Dataflow\u003c/strong\u003e: Google Cloud Dataflow es un servicio en la nube totalmente administrado para crear y evaluar pipelines de procesamiento de datos escalables. Los flujos de datos de los pipelines se basan en el modelo de programación Apache Beam y pueden operar tanto en modo por lotes como en streaming.\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003ch2\u003eDistribuidores de Hadoop\u003c/h2\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"http: //www.fuzzylogix.com/wp-content/uploads/cloudera-logo.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eCloudera\u003c/strong\u003e: Cloudera Inc. es una compañía de software con sede en los Estados Unidos que ofrece software, soporte y servicios basados ​​en Apache Hadoop y capacitación para clientes comerciales. La distribución de Apache Hadoop de código abierto de Cloudera, CDH (Cloudera Distribution incluyendo Apache Hadoop), apunta a implementaciones de clase empresarial de esa tecnología.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"180\" src\u003d\"https: //hortonworks.com/wp-content/themes/hortonworks/images/svg/ui_logo.svg\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eHortonworks\u003c/strong\u003e: Hortonworks es una empresa de software de computadoras con sede en Palo Alto, California. La compañía se enfoca en el desarrollo y soporte de Apache Hadoop, un framework que permite el procesamiento distribuido de grandes conjuntos de datos en grupos de computadoras.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"https: //mapr.com/assets/images/MapR_logo_red.svg\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eMapR Technologies\u003c/strong\u003e: MapR es una empresa de software empresarial con sede en San José, California, que desarrolla y vende software derivado de Apache Hadoop. La compañía contribuye a\u003c/li\u003e\n\u003cli\u003eproyectos de Apache Hadoop como HBase, Pig, Apache Hive y Apache ZooKeeper.\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003ch2\u003eSeguridad\u003c/h2\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"300\" src\u003d\"https: //www.protegrity.com/wp-content/uploads/2017/02/apache-ranger-logo.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eApache Ranger\u003c/strong\u003e: Ranger es un framework para habilitar, controlar y gestionar la seguridad de datos integral en toda la plataforma Hadoop.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"180\" src\u003d\"https: //dcassetcdn.com/design_img/343044/36801/36801_2851300_343044_image.png\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eSentry\u003c/strong\u003e: Apache Sentry es un sistema altamente modular para proporcionar una autorización basada en funciones de granularidad fina a datos y metadatos almacenados en un clúster Apache Hadoop.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg  height\u003d\"100\" width\u003d\"200\" src\u003d\"https: //jaxenter.de/wp-content/uploads/2014/04/knox.jpg\"\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eKnox\u003c/strong\u003e: MApache Knox Gateway es una puerta de enlace API REST para interactuar con clústeres de Hadoop. Knox Gateway proporciona un único punto de acceso para todas las interacciones REST con clústeres de Hadoop.\u003c/li\u003e\n\u003c/ul\u003e\n\u003chr /\u003e\n\u003cp\u003ePara no entrar en detalle de otras áreas más especificas, a continuación se anexan un par de fuentes donde se pueden detallar los demás componentes que conforman el ecosistema actual de Big Data.\u003c/p\u003e\n\u003cp align\u003d\"center\"\u003e\n  \u003cimg src\u003d\"http://mattturck.com/wp-content/uploads/2018/06/Matt-Turck-FirstMark-Big-Data-Landscape-2018.png\"\u003e\n\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://mattturck.com/bigdata2018/\" title\u003d\"mattturck 2018\"\u003eBigdata2018\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"https://bigdataecosystem.knowledgent.com/big-data-ecosystem/#\"\u003eBigdataecosystem\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"https://www.pentahoworld.com/sites/default/files/2017-11/Understanding-the-Big-Data-Technology-Ecosystem-PWorld2017_0.pdf\"\u003ePentahoworld\u003c/a\u003e\u003c/p\u003e\n"
          }
        ]
      },
      "apps": [],
      "jobName": "paragraph_1530217105158_-973283094",
      "id": "20180628-201825_726803088",
      "dateCreated": "Jun 28, 2018 8:18:25 PM",
      "dateStarted": "Jul 9, 2018 3:17:08 PM",
      "dateFinished": "Jul 9, 2018 3:17:08 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "user": "anonymous",
      "config": {},
      "settings": {
        "params": {},
        "forms": {}
      },
      "apps": [],
      "jobName": "paragraph_1530217201740_-786725850",
      "id": "20180628-202001_1451533712",
      "dateCreated": "Jun 28, 2018 8:20:01 PM",
      "status": "READY",
      "progressUpdateIntervalMs": 500
    }
  ],
  "name": "El ecosistema de Big Data",
  "id": "2DK27K9S6",
  "angularObjects": {
    "2CHS8UYQQ:shared_process": [],
    "2C8A4SZ9T_livy2:shared_process": [],
    "2CK8A9MEG:shared_process": [],
    "2CKAY1A8Y:shared_process": [],
    "2C4U48MY3_spark2:shared_process": [],
    "2CKEKWY8Z:shared_process": []
  },
  "config": {},
  "info": {}
}